[{"id":1499,"lastName":"Aers","bio":"Koen is currently driving the Eclipse integration of the JBoss Forge project. Earlier he was responsible for the Eclipse support and the different workflow editors of the jBPM project. Koen graduated as a Civil Engineer from the Belgian Royal Military Academy and obtained an additional Master's Degree in Information Technology at the Brussels Free University. Before joining JBoss and Red Hat, he worked respectively in the IT department of the Belgian Army and as a software consultant. Koen is a regular speaker at public events and conferences.","company":"JBoss by Red Hat","talks":[{"title":"From Zero to JavaEE in 15 Minutes (or Less)","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1910","presentationId":1910},{"title":"Raise Your Java EE 6 Productivity Bar With JBoss Forge","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1864","presentationId":1864}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1499/thumbnail.gif?time=1376397016361","firstName":"Koen","tweethandle":"@koentsje"},{"id":350,"lastName":"Algermissen","bio":"Jan Algermissen is founder and principal consultant at NORD Software Consulting. NORD provides integration architecture management consulting to major eCommerce, publishing, legal and industrial companies. Jan's primary focus is the application of Web architecture to enterprise IT. Jan has been consulting and developing distributed systems for over 15 years and has been an expert for Web architecture for the last 8 years. Jan is author of numerous articles on REST and RESTful Web services and member of the JAX-RS (JSR 311) expert group and the Microsoft WCF HTTP advisory board.","company":"NORD Software Consulting","talks":[{"title":"JAX-RS 2.0 Status & Directions","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1668","presentationId":1668},{"title":"The newest JAX-RS and JPA Features","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2100","presentationId":2100}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/350/thumbnail.gif?time=1376397016388","firstName":"Jan","tweethandle":"@algermissen"},{"id":244,"lastName":"Allen","bio":"Dan is an open source advocate, community catalyst, author and speaker. He proudly pursues these passions as a Red Hat employee and community member. In his role as Principal Software Engineer, he serves as the Arquillian community manager and draws on that experience to help make a variety of open source projects wildly successful, including Arquillian, Awestruct, Asciidoctor, JBoss Forge and CDI.\r\n\r\nDan is the author of Seam in Action (Manning, 2008), has written articles for IBM developerWorks, NFJS magazine, Java Tech Journal and JAXenter and is an internationally recognized speaker. He has presented at major software conferences including JavaOne, Devoxx, NFJS, UberConf, RWX, JAX and Jazoon and has been recognized as a JavaOne Rock Star, JBossWorld Top Presenter and JAX Hall of Fame speaker.\r\n\r\nAfter a long conference day, you'll likely find Dan enjoying chatting about tech and community with fellow community members over a Trappist beer.","company":"Red Hat, Inc.","talks":[{"title":"The bugs are building another Death Star","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2129","presentationId":2129}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/244/thumbnail.gif?time=1376397016407","firstName":"Dan","tweethandle":"@mojavelinux"},{"id":5,"lastName":"Almiray","bio":"Andres is a Java/Groovy developer and a Java Champion with more than 12 years of experience in software design and development. He has been involved in web and desktop application development since the early days of Java. He is a true believer in open source and has participated on popular projects like Groovy, Griffon, and DbUnit, as well as starting his own projects (Json-lib, EZMorph, GraphicsBuilder, JideBuilder). Founding member of the Griffon framework. Andres maintains a blog at http://jroller.com/aalmiray","company":"Canoo","talks":[{"title":"Spock: boldly go where no test has gone before","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1855","presentationId":1855},{"title":"Hackergarten Hands-On Coding Event","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1850","presentationId":1850},{"title":"Rocket propelled Java","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1852","presentationId":1852}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/5/thumbnail.gif?time=1376397016414","firstName":"Andres","tweethandle":"@aalmiray"},{"id":966,"lastName":"Ancelin","bio":"Mathieu ANCELIN is a software engineer at SERLI, specialized in Java EE technologies with a strong interest on lightweight component frameworks. Mathieu is involved in several open-source projects such as JOnAS and GlassFish, and even leads some like Weld-OSGi and Play CDI; He is a JSR-346 (CDI 1.1) expert group member and a crew member of the Poitou-Charentes JUG.","company":"SERLI","talks":[{"title":"Weld-OSGi in action","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1817","presentationId":1817}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/966/thumbnail.gif?time=1376397016440","firstName":"Mathieu","tweethandle":"@TrevorReznik"},{"id":999,"lastName":"Andreadis","bio":"Dimitris is the Manager of the JBoss Application Server group in the JBoss Division of Red Hat. He has been a JBoss addict and contributor from the early JBoss days and joined JBoss in 2004. He became the Lead of the JBoss AS project for three years since 2006. Previously he spent seven years at Intracom and Motorola in the areas of NMS/OSS, designing reusable frameworks and distributed systems. Dimitris studied computer science at the Technological Educational Institute of Athens and received an M.Sc. by research from University College Dublin, Ireland.","company":"JBoss, by Red Hat","talks":[{"title":"JBoss Application Server - Community BOF","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2001","presentationId":2001}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/999/thumbnail.gif?time=1376397016463","firstName":"Dimitris","tweethandle":"@dandreadis"},{"id":264,"lastName":"Bair","bio":"Richard Bair is the architect for the client Java platform at Oracle. He was an influential lead in the development of JavaFX UI controls and associated APIs. Prior to that he was the lead of the SwingLabs project, which was an open source community supported by Sun with a focus on enhancing and extending Swing. Before working at Sun, Blair was an application developer with a focus on data-oriented rich client applications backed by databases. He has a passion for graphics, performance, and developer productivity.","company":"Oracle","talks":[{"title":"Building Amazing Applications with JavaFX","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1636","presentationId":1636},{"title":"What’s New in JavaFX","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1637","presentationId":1637}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/264/thumbnail.gif?time=1376397016481","firstName":"Richard","tweethandle":"@richardbair"},{"id":847,"lastName":"Bakker","bio":"Paul is senior software engineer at Luminis Technologies where he works on the Amdatu platform, an open source, service-oriented application platform for web applications. \r\n\r\nHe has a background as trainer where he teached various Java related subjects. Paul is also a regular speaker on conferences such as JavaOne, Devoxx and JBossWorld.","company":"Luminis Technologies","talks":[{"title":"Building Modular Enterprise Applications in Java","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1812","presentationId":1812},{"title":"Modular Java EE in the Cloud: A Practical Guide to Modularity in the Cloud Age.","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1804","presentationId":1804}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/847/thumbnail.gif?time=1376397016513","firstName":"Paul","tweethandle":"@pbakker"},{"id":2091,"lastName":"Ball","bio":"Tom is the developer of the J2ObjC Java translator from Google.  Previously he was a distinguished engineer at Sun Microsystems, working on the JDK and NetBeans, and at Sun Labs on Jackpot.","company":"Google","talks":[{"title":"J2ObjC - A Java to iOS Objective-C translation tool and runtime.","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2112","presentationId":2112}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2091/thumbnail.gif?time=1376397016548","firstName":"Tom"},{"id":31,"lastName":"Banon","bio":"Founder of ElasticSearch, an Open Source, distributed, RESTful, Search Engine. \r\n\r\nDirector of Technology at GigaSpaces Technologies, a leading provider of a new generation of application platforms for Java and .Net environments. \r\n\r\nFounder of Compass, a Java Search Engine library built on top of Lucene.","company":"NA","talks":[{"title":"Search, the Final Frontier","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2095","presentationId":2095}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/31/thumbnail.gif?time=1376397016575","firstName":"Shay","tweethandle":"@kimchy"},{"id":2010,"lastName":"Barber","bio":"Ian Barber is a Senior Developer Advocate for Google+ who is based in Google's London office. Ian has been developing, and managing development teams, professionally since 2002, primarily dealing with web technologies after a brief stint in casual games. Among other open source interests, Ian is the author of the PHP Support Vector Machine extension and a maintainer of the brokerless messaging library ZeroMQ.","company":"Google","talks":[{"title":"Building a Clojure Google+ Client Library","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1840","presentationId":1840}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2010/thumbnail.gif?time=1376397016581","firstName":"Ian","tweethandle":"@ianbarber"},{"id":2084,"lastName":"Barr","bio":"Terrence Barr is a Senior Technologist for Mobile and Embedded Technologies at Oracle. Barr has broad development and architectural experience on embedded systems and platforms including industrial control systems, multiprocessor architectures, implementation and optimization of virtual machines, byte code hardware acceleration, advanced client-side and mobile applications, scalable client-server architectures, and more.\r\nBarr is currently driving key aspects of the embedded Java strategy and product roadmap with Java ME embedded. He regularly participates in industry organizations and standards bodies, has authored or co-authored a number of papers in the U.S. and Europe, and speaks frequently at events around the world.","company":"Oracle","talks":[{"title":"Smart, Small, Connected: Java in the Internet of Things","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2105","presentationId":2105}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2084/thumbnail.gif?time=1376397016670","firstName":"Terrence","tweethandle":"@terrencebarr"},{"id":209,"lastName":"Bartlett","bio":"Neil is a developer, consultant and trainer specializing in OSGi. He is the main developer of Bndtools, a popular Eclipse-based development environment for OSGi applications and the author of many articles, blog posts and StackOverflow answers.\r\n\r\nNeil lives in London and works for Paremus.","company":"Paremus Ltd","talks":[{"title":"How to Make your Code OSGi-Friendly Without Depending on OSGi","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1808","presentationId":1808}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/209/thumbnail.gif?time=1376397016702","firstName":"Neil","tweethandle":"@nbartlett"},{"id":1946,"lastName":"Beaton","bio":"Wayne is the Director of Open Source Projects at the Eclipse Foundation. He spends his days working with the many Eclipse projects, learning about Eclipse technology, and making sure that everybody knows just how cool it all really is. When not working, he can usually be found watching his kids play hockey at one of the many local arenas.","company":"The Eclipse Foundation","talks":[{"title":"Eclipse: An Application Lifecycle Management Success Story","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1671","presentationId":1671}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1946/thumbnail.gif?time=1376397016719","firstName":"Wayne","tweethandle":"@waynebeaton"},{"id":2133,"lastName":"Behrens","bio":"Nick has been at Google for 6 years, working on various Gmail front end and back end systems, he graduated from MIT. Nick became a Guice expert when he helped  modularize the Gmail front end server.","company":"Google","talks":[{"title":"Effective Dependency Injection","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1616","presentationId":1616}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Nicholas"},{"id":117,"lastName":"Bernard","bio":"Emmanuel Bernard est architecte plate-forme données à JBoss by Red Hat et un membre de l'équipe Hibernate.\r\n\r\nDiplômé de Supélec, Emmanuel Bernard a passé quelques années dans le secteur de la grande distribution où il a commencé à s'impliquer dans le monde de l'ORM. Il a rejoint l'équipe Hibernate en 2003.\r\n\r\nEmmanuel a dirigé l'implementation JPA d'Hibernate. Il a fondé et dirige Hibernate Search, Hibernate Validator et le petit nouveau Hibernate OGM.\r\n\r\nEmmanuel est membre de l'expert group JPA 2.1 et spec lead de Bean Validation. Il intervient régulièrement dans diverses conférences et JUGs, dont JavaOne, JBoss World, Devoxx et est le co-auteur d'Hibernate Search in Action publié par Manning. Il est aussi le fondateur et co-hôte de deux podcasts: Les Cast Codeurs (Français) et JBoss Community Asylum (Anglais).\r\n\r\nVous pouvez le suivre sur twitter à @emmanuelbernard.","company":"JBoss by Red Hat","talks":[{"title":"Write your first Ceylon program with the language authors","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1914","presentationId":1914},{"title":"Bean Validation 1.1: it's not Beansland anymore","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1994","presentationId":1994},{"title":"Les Cast Codeurs Podcast","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2097","presentationId":2097}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Emmanuel","tweethandle":"@emmanuelbernard"},{"id":131,"lastName":"Bien","bio":"Consultant and author Adam Bien (blog.adam-bien.com) is an Expert Group member for the Java EE 6, EJB 3.1, and JPA 2.0 JSRs. He has worked with Java technology since JDK 1.0 and Servlets/EJB 1.0 in several large-scale projects and is now an architect and developer in Java SE/EE/FX projects. He has edited several books about Java (FX) and J2EE / Java EE and is the author of Real World J2EE Patterns. Adam is a Java Champion and JavaOne 2009 Rock Star.","company":"adam-bien.com","talks":[{"title":"Real World Java EE","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2064","presentationId":2064}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/131/thumbnail.gif?time=1376397016825","firstName":"Adam","tweethandle":"@AdamBien"},{"id":2074,"lastName":"Blaukopf","bio":"Daniel is a Java Client Architect at Oracle, working on JavaFX. Daniel's focus in his 14 years in the Java organization has been mobile and embedded devices, including working with device manufacturers to port and tune all levels of the Java stack to their hardware and software environments. Daniel's particular interests are: graphics, performance optimization and functional programming.","company":"Oracle","talks":[{"title":"JavaFX on Smart Embedded Devices","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2094","presentationId":2094}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2074/thumbnail.gif?time=1376397016847","firstName":"Daniel"},{"id":2061,"lastName":"Blevins","bio":"Veteran of Open Source Java EE in both implementing and defining JavaEE specifications for over 10 years with a strong drive to see JavaEE simple, testable and as light as Java SE. Co-Founder of OpenEJB (1999), Geronimo (2003), TomEE (2011). Member of the Java EE 7 and EJB 3.2 Expert Groups, past member of the Java EE 6, EJB 3.1, and EJB 3.0 Expert Groups. Contributing author to Component-Based Software Engineering: Putting the Pieces Together from Addison Wesley.","company":"Apache","talks":[{"title":"Apache TomEE, Java EE 6 Web Profile on Tomcat","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2068","presentationId":2068},{"title":"Java EE 7, Infinite Extensibility meets Infinite Reuse","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2135","presentationId":2135}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2061/thumbnail.gif?time=1376397016861","firstName":"David","tweethandle":"@dblevins"},{"id":119,"lastName":"Bonazzo","bio":"Over 30 years experience in the IT world.\r\nPassionate about new tecnology and always open to new solution.\r\nMy career:\r\n- Project Manager to close the European community (Eurovet II)\r\n- Project Manager for Animal Health (SIGLA) to nearly 6 IIZZSS\r\n- Project Manager Rentsardinia.com sardiniapoint.com sardiniaclimb.com\r\n- Speaker at different springframework meeting\r\n- Evangelist Entando","company":"Entando Ltd","talks":[{"title":"The advantage of Using Rest API’s in Portal Platforms to extend the reach of the portal.","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1696","presentationId":1696}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/119/thumbnail.gif?time=1376397016889","firstName":"Rinaldo","tweethandle":"@RinaldoBonazzo"},{"id":807,"lastName":"Bonér","bio":"Jonas Bonér is a geek, programmer, speaker, musician, writer and Java Champion. He is the CTO and co-founder of Typesafe and is an active contributor to the Open Source community; most notably founded the Akka Project and the AspectWerkz AOP compiler (now AspectJ). Learn more at: http://jonasboner.com","company":"Typesafe","talks":[{"title":"Up up and Out: Scaling software with Akka","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1747","presentationId":1747}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/807/thumbnail.gif?time=1376397016914","firstName":"Jonas","tweethandle":"@jboner"},{"id":1914,"lastName":"Borg","bio":"Sr Engineering Manager in the Java group at Oracle.","company":"Oracle","talks":[{"title":"OpenJDK Community Update","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1579","presentationId":1579}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1914/thumbnail.gif?time=1376397016941","firstName":"Cecilia","tweethandle":"@CeciliaBorg"},{"id":1355,"lastName":"Borggren-Franck","bio":"Joel works in the Langtools team at Oracle Java Platform Group. He is currently working on the Java compiler in general and new annotation features in particular. Coming from the JRockit Sustaining Engineering organization he sometimes misses debugging crashed VMs by looking at assembler in hex in GDB. During nighttime he hacks on toy virtual machines for dynamically typed languages.","company":"Oracle","talks":[{"title":"Annotation Features in JDK 8","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2043","presentationId":2043}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1355/thumbnail.gif?time=1376397016957","firstName":"Joel"},{"id":1291,"lastName":"Bort","bio":"Guillaume Bort is cofounder of Zenexity, the french ‘Web Oriented Architecture’ company. Former J2EE expert, he worked several years on constructing Web frameworks for large scale companies including banks, until he decided to sum up his experience by creating Play framework focusing back on simplicity. He still leads development of the Play framework.","company":"Zenexity","talks":[{"title":"Play Framework - Crash Course","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1733","presentationId":1733}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1291/thumbnail.gif?time=1376397016963","firstName":"Guillaume","tweethandle":"@guillaumebort"},{"id":2052,"lastName":"Boza Rodriguez","bio":"Israel is a jack of all trades, interested in everything that our industry has to offer: technology, process, business and people.  He's moved from a systems / hardware background to a development role at LMAX, a financial exchange in London, which gives him plenty of opportunities to absorb knowledge across the business/technology spectrum.","company":"LMAX","talks":[{"title":"Agile ++: When Agile Goes Well","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1971","presentationId":1971}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Israel"},{"id":2089,"lastName":"Bradberry","bio":"Daniel is Head of Security Tools Development at MWR InfoSecurity, with a passion for building things that work. He has 10 years of experience in building web applications and has recently shifted focus to mobile, particularly Android.\r\n\r\nDaniel is a keen advocate of open source software, and has released and contributed to a number of projects, including the IPv6 Compliance Testing framework veripy.","company":"MWR InfoSecurity","talks":[{"title":"Security Testing Android with Mercury","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2110","presentationId":2110}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Daniel"},{"id":1085,"lastName":"Bray","bio":"Tim is a software developer and entrepreneur, currently working as Developer Advocate for Android at Google. He lives in Vancouver, Canada, and travels heavily. Tim co-founded Open Text Corporation and Antarctica Systems. Bray was Director of Web Technologies at Sun Microsystems from early 2004 to early 2010.","company":"Google","talks":[{"title":"Life online","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2065","presentationId":2065},{"title":"OAuth 2 and Identity","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2069","presentationId":2069}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1085/thumbnail.gif?time=1376397017027","firstName":"Tim","tweethandle":"@timbray"},{"id":2069,"lastName":"Browning","bio":"Ben is the lead of the TorqueBox project and an active contributor to many other open-source projects. He spent several years in the enterprise Java world before embracing the JRuby goodness and now works hard at Red Hat to bring the Ruby and Java communities together through TorqueBox.","company":"Red Hat","talks":[{"title":"Why JRuby and TorqueBox Belong in Your Java Tool Box","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2089","presentationId":2089}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2069/thumbnail.gif?time=1376397017049","firstName":"Ben"},{"id":2139,"lastName":"Buls","bio":"Sam Buls is working as a PhD student and Research Engineer in Additive Manufacturing (3D printing) at KU Leuven. His main research topic and background skill lies in machine design/building, system control and laser optics. At an early age he had a passion for mechatronics and embedded systems.  The willingness to share his knowledge and experiences with others made him a helping hand, adviser and promoter for several projects and theses. He also has a strong background in assembler, C++ and Unix Systems.","company":"KU Leuven","talks":[{"title":"NFC, Arduino, Raspberry PI, Android and NodsJS Case-Study","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2083","presentationId":2083}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2139/thumbnail.gif?time=1376397017056","firstName":"Sam"},{"id":1082,"lastName":"Butcher","bio":"Nick is an Android Developer Advocate in Google's London office. He has a passion for mobile technologies and learned his trade in the gnarly world of Windows Mobile development. He is particularly interested in producing sublime mobile user interfaces & works with developers to make high quality Android apps. In his spare time he is an aspiring runner & triathlete.","company":"Google","talks":[{"title":"Android Development Code Lab","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2098","presentationId":2098}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1082/thumbnail.gif?time=1376397017080","firstName":"Nick","tweethandle":"@crafty"},{"id":1852,"lastName":"Cappelle","bio":"Hans Cappelle is an independent, full time, J2EE Software Engineer and Android Developer. Most of his time you'll find him working on software solutions for financial companies.\r\n\r\nWhen Hans is not at work he's probably flying around one of his remote controlled aircrafts or working on another electronics project. He started with RC a long time ago and often found the need to adapt and create electronics for this hobby. \r\n\r\nHis interest in electronics and his love for open source solutions led him inevitably to the Arduino platform. Speaking at several job related events he soon started talking about how to combine Android and Arduino into robotic platforms.","company":"hcpl","talks":[{"title":"NFC, Arduino, Raspberry PI, Android and NodsJS Case-Study","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2083","presentationId":2083},{"title":"ArduPilot: an Introduction to UAVs","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1573","presentationId":1573}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1852/thumbnail.gif?time=1376397017183","firstName":"Hans","tweethandle":"@cappha"},{"id":527,"lastName":"Carl","bio":"I am doing everything between Java/web developer and architect, having my main emphasis on Java Enterprise Edition 6 technologies. I’m founder of the Brussels Java User Group and currently also member of the DEVOXX and DEVOXX4Kids team.","company":"Freelancer","talks":[{"title":"The Fascinating World of NAO","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2099","presentationId":2099}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/527/thumbnail.gif?time=1376397017201","firstName":"Tasha","tweethandle":"@Imifos"},{"id":2013,"lastName":"Caska","bio":"James Caska lives on the edge where software meets hardware with the mission to seamlessly connect high level languages, skills and tools to the mechatronic real world of sensors, motors and physical interaction. James is the creator of an integrated suite of technologies that work together to blur the edge of virtual and real. Including VirtualBreadboard (www.virtualbreadboard.com) – the abstract hardware design and simulation tool that makes the real world virtual, and Muvium (www.muvium.com)- the Ahead-Of-Time Java compiler for microcontrollers that makes the virtual world real.","company":"VirtualBreadboard","talks":[{"title":"‘Back to the Future’ – Taking Arduino back to its Java roots to move forward","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1870","presentationId":1870}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2013/thumbnail.gif?time=1376397017246","firstName":"James"},{"id":2099,"lastName":"Cattoir","bio":"Eric Cattoir is a Rational Client Technical Profession at IBM Belgium. He has a long experience with application development on various platforms and in particular in Java. Working at IBM since 1994 he had the chance to get involved with many technologies both on the hardware and software side.\r\nWithin his current job he is helping clients with improving their control over the application life cycle using the IBM Rational Jazz based tools. Current interest also include enterprise architecture, scaling of agile development to larger organizations, mobile technologies and Smarter City projects.","company":"IBM","talks":[{"title":"Mobile Applications Development Lifecycle","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2116","presentationId":2116}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2099/thumbnail.gif?time=1376397017253","firstName":"Eric"},{"id":1376,"lastName":"Champeau","bio":"Cédric Champeau is a core Groovy committer. He joined SpringSource, a division of VMware, in order to help developing the language. Prior to that, he spent several years at Lingway, a software editor, where he used Groovy in multiple industrial contexts including DSLs for natural language processing, scripting or even workflows.\r\n\r\nCédric Champeau est committer sur Groovy Core. Il a rejoint SpringSource, une division de VMware, afin de participer au développement du langage après avoir passé plusieurs années à l'exploiter de manière industrielle chez un éditeur logiciel, Lingway, dans de multiples contextes (DSL, scripting, workflows, ...).","company":"VMware","talks":[{"title":"What's new in Groovy 2.0?","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1792","presentationId":1792}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1376/thumbnail.gif?time=1376397017285","firstName":"Cédric","tweethandle":"@CedricChampeau"},{"id":195,"lastName":"Champenois","bio":"Ludovic Champenois est un ingénieur logiciel chez Google à San Francisco, supervisant Google App Engine Java runtime et les outils.","company":"Google","talks":[{"title":"What's new with Google App Engine and Compute Engine?","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1784","presentationId":1784}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/195/thumbnail.gif?time=1376397017293","firstName":"Ludovic","tweethandle":"@ludoch"},{"id":1777,"lastName":"Chan","bio":"Chiu-Ki was on the Android server team when the G1 came out. She switched to apps development when she moved to the maps team, building Google Mobile Maps for Android. After a brief stint in Web development at two startups, Chiu-Ki is now back at her Android roots with her own company for mobile development. The first title is \"Monkey Write,\" an app for learning Chinese writing, which recently won Grand Prize in the Samsung Galaxy Note App Challenge.","company":"Square Island LLC","talks":[{"title":"Android Custom Components","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1508","presentationId":1508}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1777/thumbnail.gif?time=1376397017318","firstName":"Chiu-Ki","tweethandle":"@chiuki"},{"id":98,"lastName":"Chin","bio":"Stephen Chin is a Java Technology Ambassador at Oracle specializing in UI technology and co-author of the Pro JavaFX Platform 2 title, which is the leading technical reference for JavaFX. He has been featured at Java conferences around the world including Devoxx, Codemash, OSCON, J-Fall, GeeCON, Jazoon, and JavaOne, where he twice received a Rock Star Award. In his evenings and weekends, Stephen is an open-source hacker, working on projects including ScalaFX, a DSL for JavaFX in the Scala language, Visage, a UI oriented JVM language, JFXtras, a JavaFX component and extension library, and Apropos, an Agile Project Portfolio scheduling tool written in JavaFX. Stephen can be followed on twitter @steveonjava and reached via his blog: http://steveonjava.com/","company":"Oracle","talks":[{"title":"The Mocha Raspberry Pi Lab","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1675","presentationId":1675}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/98/thumbnail.gif?time=1376397017437","firstName":"Stephen","tweethandle":"@steveonjava"},{"id":1639,"lastName":"Clochard","bio":"Matthieu CLOCHARD is a software engineer at SERLI. Immediately diving into open-source projects, he works to continue the OSGi integration for CDI reference implementation Weld. Weld-OSGi rapidly turned to be a complete framework and Matthieu continues to improve its features. Beside open-source projects, Matthieu also deals with virtualized environments for IT industrialization and portal based solutions for enterprise intra and extranets. He is an assiduous attendee to Poitou-Charentes JUG and other Java events he can take part.","company":"SERLI","talks":[{"title":"Weld-OSGi in action","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1817","presentationId":1817}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1639/thumbnail.gif?time=1376397017471","firstName":"Matthieu"},{"id":1932,"lastName":"Coupland","bio":"Java server side engineer for 8 years, creating and maintaining data centric applications for start-up sized team through to large organisations. Currently employed by Nokia at it's Entertainment R&D office in Bristol UK.","company":"Nokia","talks":[{"title":"10 Months of MongoDB at Nokia Entertainment Bristol","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1650","presentationId":1650}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1932/thumbnail.gif?time=1376397017510","firstName":"Tom","tweethandle":"@tcoupland"},{"id":2044,"lastName":"Cummins","bio":"Holly Cummins is a senior software engineer developing enterprise middleware with the IBM WebSphere, and a committer on the Apache Aries project. She is a co-author of Enterprise OSGi in Action and has spoken at Devoxx, JavaZone, The ServerSide Java Symposium, JAX London, GeeCon, and the Great Indian Developer Summit, as well as a number of user groups.","company":"IBM","talks":[{"title":"How to embed an application server into a hat","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2136","presentationId":2136},{"title":"Building Modular Applications with Enterprise OSGi","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1963","presentationId":1963}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2044/thumbnail.gif?time=1376397017535","firstName":"Holly","tweethandle":"@holly_cummins"},{"id":2111,"lastName":"Curran","bio":"Patrick Curran is Chair of the JCP. In this role he oversees the activities of the JCP Program Office including driving the process, managing its membership, guiding specification leads and experts through the process, leading the Executive Committee meetings, and managing the JCP.org web site. Patrick has worked in the software industry for more than 20 years and at Sun for 15 years. He has a long-standing record in conformance testing, and most recently led the Java Conformance Engineering team in Sun's Client Software Group. He was also chair of Sun's Conformance Council, which is responsible for defining Sun's policies and strategies around Java conformance and compatibility.\r\n \r\nPatrick has participated actively in several consortia and communities including the World Wide Web Consortium (W3C) (member of the W3C's Quality Assurance Working Group, co-chair of the W3C Quality Assurance Interest Group), and the Organization for the Advancement of Structured Information Standards (OASIS) (co-chair of the OASIS Test Assertions Guidelines Technical Committee). \r\n\r\nPatrick blogs at http://blogs.oracle.com/pcurran/","company":"JCP","talks":[{"title":"The JCP program: More that 101 ways to influence the future of the Java Platform","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2123","presentationId":2123}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2111/thumbnail.gif?time=1376397017578","firstName":"Patrick"},{"id":282,"lastName":"Darcy","bio":"At Oracle Joe was the lead engineer of Project Coin, the effort to select and implement a set of small Java language changes for JDK 7. Previously Joe was the release manager, lead engineer, and quality lead for OpenJDK 6, an open source implementation of the Java SE 6 platform.  A longtime member of the JDK engineering group, Joe was specification lead for JSR 269, the Pluggable Annotation Processing API, which delivered a standardized annotation processing API and mirror-based language model into JDK 6 to supersede the earlier apt tool from JDK 5. Joe assisted in implementing the JDK 5 language changes with work spanning core reflection, javac hacking, and general library support.\r\n\r\nJoe holds a master's degree in computer science from UC Berkeley and a master's degree in applied math from Stanford University.","company":"Oracle","talks":[{"title":"On the road to JDK 8: Lambda, parallel libraries, and more","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2124","presentationId":2124}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/282/thumbnail.gif?time=1376397017600","firstName":"Joe","tweethandle":"@jddarcy"},{"id":2154,"lastName":"de Longa","bio":"John has held numerous roles in the Product support and PreSales as well as working in the Business Systems side of the organisation for a number of years.\r\n\r\nJohn de Longa is at present a Solutions Consultant working in EMEA for both the Direct Corporate Customers as well as ISVs who embed Progress | DataDirect connectivity into their applications.\r\n\r\nHe has worked for the company many years, seeing the creation of ODBC, JDBC Drivers for a wide variety of RDBMS sources and now helping to evangelise on new ODBC and JDBC Drivers to connect to Cloud based data sources.","company":"Progress Software","talks":[{"title":"Connecting an enterprise’s Java based reporting infrastructure to Salesforce.com data","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2106","presentationId":2106}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2154/thumbnail.gif?time=1376397017637","firstName":"John"},{"id":2101,"lastName":"De Rycke","bio":"Thomas De Rycke has more than 7 years of professional experience in all aspects of the system development lifecycle. Thomas De Rycke works as a Project manager at Smals, and is constantly looking for ways to increase operational efficiency. He evangelizes the need to have a high level of automated tests which leads to maintainable codebases and the ability to release high quality software in a fast and consistent way.","company":"Smals","talks":[{"title":"Unitils : Full stack testing solution for enterpise applications","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2122","presentationId":2122}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2101/thumbnail.gif?time=1376397017657","firstName":"Thomas","tweethandle":"@thomasiderycke"},{"id":761,"lastName":"De Smet","bio":"Geoffrey De Smet (Red Hat) is the lead and founder of Drools Planner. Before joining Red Hat in 2010, he was formerly employed as a Java consultant, an A.I. researcher and an enterprise application project lead. He has contributed to many open source projects (such as drools, jbpm, pressgang, spring-richclient, several maven plugins, weld, arquillian, ...). Since he started Drools Planner in 2006, he’s been passionately addicted to planning optimization.","company":"Red Hat","talks":[{"title":"Maven dependency puzzlers","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1720","presentationId":1720}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/761/thumbnail.gif?time=1376397017673","firstName":"Geoffrey","tweethandle":"@geoffreydesmet"},{"id":205,"lastName":"Debois","bio":"In order to understand current IT organizations, Patrick has taken a habit of changing both his consultancy role and the domain which he works in: sometimes as a developer, manager, sysadmin, tester and even as the customer.\r\n\r\nDuring 15 years of consultancy, there is one thing that annoys him badly, it is the great divide between all these groups. But times are changing now: being a player on the market requires you to get these ‘battles’ under control between these silos.\r\n\r\nHe first presented concepts on Agile Infrastructure at Agile 2008 in Toronto, and in 2009 he organized the first devopsdays . Since then he has been promoting the notion of ‘devops’ to exchange ideas between these groups and show how they can help each other to achieve better results in business.","company":"jedi bvba","talks":[{"title":"Code but not as we know it - Infrastructure as code","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1779","presentationId":1779}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/205/thumbnail.gif?time=1376397017680","firstName":"Patrick","tweethandle":"@patrickdebois"},{"id":2014,"lastName":"DEFRANCE","bio":"Currently I'm working as Project Lead at eXo platform on social application.\r\nI'm also an open source developer and I contributed to several open source projects like eXo Social, eXo Forum, GateIn, CRaSH, Wikkbook, Chromattic, byteman.","company":"eXo Platform","talks":[{"title":"CRaSH an extensible command line for the JVM","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1846","presentationId":1846}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2014/thumbnail.gif?time=1376397017725","firstName":"Alain","tweethandle":"@alaindefrance"},{"id":184,"lastName":"Delabassee","bio":"David Delabassee is a Product Manager working at Oracle in the GlassFish and Java EE Team. Prior to that, he spent the last 10 years at Sun Microsystems focusing on Java end-to-end (from the smart card to the high end server), all the related technologies, and the developer tools. He has been involved in Java projects since the early days of this technology. David is a steering member of Devoxx, Europe largest Java conference. \r\nIn his spare time, he enjoy tinkering and playing with technologies such as Java, Arduino, Processing, Linux, etc.","company":"Oracle","talks":[{"title":"Java EE Gathering","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1617","presentationId":1617}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/184/thumbnail.gif?time=1376397017821","firstName":"David","tweethandle":"@delabassee"},{"id":1988,"lastName":"Deprez","bio":"Dr. Jean-Christophe Deprez is Scientific Coodinator at the Centre d'Excellence en Technologies de l'Information et de la Communication (CETIC) in Charleroi, Belgium. He was the project coordinator of QUALOSS, an FP6 European Research Project on quality in open source and proposer of ExSec experiment on BonFIRE (FP7). He is a Belgian representative in the ISO Sub-Committees 7 on software and system engineering and also participate in SC 27 (security), SC 38 (Distributed Computing) and TR215 (Health Informatics). He received his Ph.D. in Computer Science from the University of Louisiana at Lafayette in May 2003. Prior to joining CETIC in 2005, he was professor at Pace University in New York, USA since 2001. His research goals are to develop procedures and tools to analyze and improve software quality and software development processes with a particular interest in reuse, refactoring and testing.\r\n\r\nIn direct relation with the proposed talk, Jean-Christophe Deprez is currently implementing in Java an OSLC Redmine Connector for Change Management and Requirement Management as part of the Naples project.","company":"CETIC","talks":[{"title":"Connect ALM tools thanks to the Open Services for Lifecycle Collaboration specification","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1908","presentationId":1908}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1988/thumbnail.gif?time=1376397017837","firstName":"Jean-Christophe"},{"id":2058,"lastName":"Diallo","bio":"Abdoul Gadiri Diallo is an IT Specialist within the Software Group division of IBM. He graduated from the Universite Libre de Bruxelles as an engineer in computer sciences. His main focus areas includes Application Integration Middleware and IBM Mobile Foundation.","company":"IBM","talks":[{"title":"Hybrid mobile application development using Apache Cordova","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1959","presentationId":1959}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2058/thumbnail.gif?time=1376397017856","firstName":"Abdoul Gadiri"},{"id":311,"lastName":"Dobler","bio":"Former Flash Platform junkie on cold turkey.","company":"Richapps","talks":[{"title":"Progress at Parleys.com, a Java based e-Learning platform","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2049","presentationId":2049}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/311/thumbnail.gif?time=1376397017884","firstName":"Benjamin","tweethandle":"@richapps"},{"id":1921,"lastName":"Dochez","bio":"Jerome Dochez : Jerome has been at Google less than a year working on Gmail with Guice. Prior to Google, he was working for Sun/Oracle where he co-authored the HK2 dependency injection framework and led the modularization of the GlassFish Open Source application server. Jerome spoke at the last 2 Devoxx conferences as well as 13 JavaOne conferences.","company":"Google Inc.","talks":[{"title":"Effective Dependency Injection","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1616","presentationId":1616}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1921/thumbnail.gif?time=1376397017904","firstName":"Jerome","tweethandle":"@dochez"},{"id":958,"lastName":"Dockter","bio":"Hans Dockter is the founder and project lead of the Gradle build system and the CEO of Gradleware, a company that provides training, support and consulting for Gradle and all forms of enterprise software project automation in general.\r\n\r\nHans has 15 years of experience as a software developer, team leader, architect, trainer, and technical mentor. Hans is a thought leader in the field of project automation and has successfully been in charge of numerous large-scale enterprise builds. He is also an advocate of Domain Driven Design, having taught classes and delivered presentations on this topic together with Eric Evans. In the earlier days, Hans was also a committer for the JBoss project and founded the JBoss-IDE.","company":"Gradleware","talks":[{"title":"The new Android Build System","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2091","presentationId":2091},{"title":"Hackergarten Hands-On Coding Event","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1850","presentationId":1850}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/958/thumbnail.gif?time=1376397017938","firstName":"Hans","tweethandle":"@gradleware"},{"id":65,"lastName":"Drobi","bio":"Sadek Drobi est directeur technique de Zenexity, cabinet spécialisé dans les architectures orientées Web. Il est un architecte expérimenté, spécialisé dans la création d'application d'entreprise fortement distribuées, avec un intérêt particulier dans les langages de programmation et la création d'API et de framework pour résoudre les problèmes complexes au bon niveau d'abstraction. Il est `Core Developer` sur le project Play.","company":"Zenexity","talks":[{"title":"Play Framework - Crash Course","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1733","presentationId":1733}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/65/thumbnail.gif?time=1376397018054","firstName":"Sadek","tweethandle":"@sadache"},{"id":1079,"lastName":"Ducrohet","bio":"Xavier is the tech-lead for the Android SDK and Developer Tools. He joined Google in 2007 and holds a MS in Computer Science from EFREI, France.","company":"Google Inc.","talks":[{"title":"The new Android Build System","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2091","presentationId":2091},{"title":"What's New in Android Developers’ Tools","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2090","presentationId":2090},{"title":"Android Tools in Action","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2085","presentationId":2085}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1079/thumbnail.gif?time=1376397018084","firstName":"Xavier","tweethandle":"@droidxav"},{"id":744,"lastName":"Duponcheel","bio":"Java and Scala Developer/Instructor\r\nFounder of ImagineJ","company":"ImagineJ","talks":[{"title":"Scala Enthusiasts Gathering","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1612","presentationId":1612}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/744/thumbnail.gif?time=1376397018129","firstName":"Luc","tweethandle":"@LucDup"},{"id":1084,"lastName":"Dutton","bio":"Sam Dutton is a Developer Advocate for Chrome at Google in London. Sam has designed and coded numerous websites, built applications with C++/Qt, and for Symbian and Android. He is excited by the increasingly high base level of capability in browsers and a multitude of devices. He previously worked for the BBC and ITN and  is a governor at Ravenstone School in London.","company":"Google","talks":[{"title":"Fast UIs for the mobile web","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2045","presentationId":2045},{"title":"Disruptive Media","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1756","presentationId":1756}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1084/thumbnail.gif?time=1376397018148","firstName":"Sam","tweethandle":"@sw12"},{"id":1892,"lastName":"Ebbers","bio":"Hendrik Ebbers is the Head of Java-Developement at SIC GmbH in Dortmund, Germany. His main focus besides research and development is primarily in the areas of Swing, JavaFX, Middleware and server side infrastructure. Additionally Hendrik Ebbers is founder and leader of the Java User Group Dortmund and gives talks and presentations in User Groups and Conferences. He's blogging about UI related topics at www.guigarage.com and contributes to some Open Source Projects: DataFX, JFXtras, Vagrant-Binding.","company":"SIC GmbH","talks":[{"title":"lightweight and reproducible environments with Vagrant and Puppet","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1659","presentationId":1659}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1892/thumbnail.gif?time=1376397018154","firstName":"Hendrik","tweethandle":"@hendrikEbbers"},{"id":2075,"lastName":"Eisele","bio":"Markus is a principal technology consultant working for msg systems ag in Germany. Markus is a software architect, developer and consultant. He also writes for IT magazines. Markus joined msg in 2002 and has been a member of the Center of Competence IT-Architecture for nine years. After that Markus moved on to the IT-Strategy and Architecture group. He works daily with customers and projects dealing with Enterprise level Java and infrastructures. This includes the Java platform and several Web-related technologies on a variety of platforms using products from different vendors. His main area of expertise are Java EE Servers. He is an Oracle ACE Director since 2008. DOAG Advisory Board Member and iJUG representative. Markus is speaking at different conferences about his favorite topics. He is also part of the Java EE 7 expert group.","company":"msg systems ag","talks":[{"title":"Java EE Gathering","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1617","presentationId":1617}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2075/thumbnail.gif?time=1376397018174","firstName":"Markus","tweethandle":"@myfear"},{"id":762,"lastName":"Epardaud","bio":"From deep into the Nice mountains, Stéphane works for Red Hat on the Ceylon project.\r\n\r\nPassionate hacker in Java, C, Perl or Scheme. A web standards and database enthusiast, he implemented among other things a WYSIWYG XML editor, a multi-threading library in C, a mobile-agent language in Scheme (compiler and virtual machines), and some Web 2.0 RESTful services and rich web interfaces with JavaScript and HTML 5.\r\n\r\nEager to share, he is a frequent speaker at various conferences such as the Scheme Workshop 2004, Nice Technical University in 2008, Polytech'Nice en 2009, Mars JUG, Paris JUG and Riviera Java User Group he founded with Nicolas Leroux. A long-time open-source user and advocate, he is committer on RESTEasy, author of jax-doclets, stamps.js and various Play! Framework modules, and developper on various Ceylon projects for Red Hat.","company":"JBoss by Red Hat","talks":[{"title":"Write your first Ceylon program with the language authors","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1914","presentationId":1914}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/762/thumbnail.gif?time=1376397018324","firstName":"Stephane","tweethandle":"@StefEpardaud"},{"id":845,"lastName":"Ertman","bio":"Bert is a Fellow at Luminis in the Netherlands. Next to his customer assignments he is responsible for stimulating innovation, knowledge sharing, coaching, technology choices and presales activities. Besides his day job he is a Java User Group leader for NLJUG, the Dutch Java User Group (3500+ members). A frequent speaker on Java (SE/EE) and Software Architecture related topics as well as an author and member of the editorial advisory board for Dutch software development magazine: Java Magazine. In 2008, Bert was honored by being awarded the coveted title of Java Champion by an international panel of Java leaders and luminaries.","company":"Luminis","talks":[{"title":"Building Modular Enterprise Applications in Java","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1812","presentationId":1812},{"title":"Modular Java EE in the Cloud: A Practical Guide to Modularity in the Cloud Age.","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1804","presentationId":1804}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/845/thumbnail.gif?time=1376397018357","firstName":"Bert","tweethandle":"@BertErtman"},{"id":930,"lastName":"Evans","bio":"Ben Evans has lived in \"Interesting Times\" in technology - he was the lead performance testing engineer for the Google IPO, worked on the initial UK trials of 3G networks with BT, built award-winning websites for some of Hollywood's biggest hits of the 90s, rearchitected and reimagined technology helping some of the most vulnerable people in the UK and has worked on everything from some of the UKs very first ecommerce sites, through to multi-billion dollar currency trading systems. \r\n\r\nHe is the CEO of a Java performance company, helps to run the London Java Community, and represents the JUG on the Java SE/EE Executive Committee. His first book \"The Well-Grounded Java Developer\" (with Martijn Verburg) has just been published by Manning.","company":"jClarity","talks":[{"title":"Modern Software Development Anti-Patterns","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1709","presentationId":1709},{"title":"OpenJDK Hack Session (Bugathon for the Adopt OpenJDK Program)","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1707","presentationId":1707}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/930/thumbnail.gif?time=1376397018548","firstName":"Ben","tweethandle":"@kittylyst"},{"id":991,"lastName":"Fain","bio":"Yakov Fain works for Farata Systems, a company that provides consulting services in the field of development of enterprise Web applications. He authored several technical books. Sun Microsystems has nominated and awarded Mr. Fain with the title of Java Champion. His latest book \"Java Programming. 24-Hour Trainer\" was published by Wiley in 2011. Yakov leads the Princeton Java Users Group.","company":"Farata Systems","talks":[{"title":"JavaScript for Java Developers","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1503","presentationId":1503}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/991/thumbnail.gif?time=1376397018574","firstName":"Yakov","tweethandle":"@yfain"},{"id":276,"lastName":"Ford","bio":"Neal Ford is Software Architect and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, instructional materials, magazine articles, courseware, video/DVD presentations, and author and/or editor of 6 books spanning a variety of technologies, including the most recent The Productive Programmer. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 100 developer conferences worldwide, delivering more than 600 talks. Check out his web site at http://www.nealford.com. He welcomes feedback and can be reached at nford@thoughtworks.com.","company":"ThoughtWorks Inc","talks":[{"title":"When Geek Leaks","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2070","presentationId":2070}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/276/thumbnail.gif?time=1376397018581","firstName":"Neal","tweethandle":"@neal4d"},{"id":2060,"lastName":"Fox","bio":"Tim Fox is the project lead of Vert.x. Tim developed Vert.x at VMware from Feb 2011 til Jan 2013 and has since moved to Red Hat where he continue to work as the lead of the Vert.x project. During his time at VMware, Tim also worked with the RabbitMQ team.\r\n\r\nPreviously, Tim had the role of Messaging Lead at JBoss / Red Hat, where he was the creator of HornetQ - the world's fastest enterprise messaging system.","company":"VMWare","talks":[{"title":"Vert.x","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2057","presentationId":2057}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2060/thumbnail.gif?time=1376397018598","firstName":"Tim","tweethandle":"@timfox"},{"id":1375,"lastName":"Frankel","bio":"Nicolas Fränkel is a software architect with more than 10 years of experience, specialized in Java and JavaEE technologies. His interests hover around Graphical User Interface, build automation and software quality. Nicolas also tries to teach what he learnt in French and Swiss universities and is also the author of Learning Vaadin.","company":"hybris","talks":[{"title":"Starting off Vaadin 7 on the right foot","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1622","presentationId":1622}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1375/thumbnail.gif?time=1376397018716","firstName":"Nicolas","tweethandle":"@nicolas_frankel"},{"id":1990,"lastName":"Garnier","bio":"Nicolas Garnier joined Google’s Developer Relations in 2008 and lives in Zurich. He is a Developer Advocate focusing on Google Drive and Web APIs. Nicolas is also the lead engineer for the OAuth 2.0 Playground. Before joining Google, Nicolas worked at Airbus and at the French Space Agency where he built web applications for scientific researchers.","company":"Google","talks":[{"title":"Google Drive SDK","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1789","presentationId":1789},{"title":"OAuth 2 and Identity","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2069","presentationId":2069}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1990/thumbnail.gif?time=1376397018726","firstName":"Nicolas","tweethandle":"@Nivco"},{"id":2041,"lastName":"Gee","bio":"Trisha is a developer at 10gen (the MongoDB company).  She has expertise in Java high performance systems, is passionate about enabling developer productivity, and has a wide breadth of industry experience from the 12 years she's been a professional developer.  Trisha is a leader in the London Java Community, and involved in the Graduate Development Community, she believes we shouldn't all have to make the same mistakes again and again.","company":"10gen","talks":[{"title":"Why Open Source Your Secrets","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1969","presentationId":1969},{"title":"The Problem With Women: A Technical Approach","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2128","presentationId":2128},{"title":"Agile ++: When Agile Goes Well","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1971","presentationId":1971}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2041/thumbnail.gif?time=1376397018755","firstName":"Trisha","tweethandle":"@trisha_gee"},{"id":2042,"lastName":"Giles","bio":"Jonathan Giles is the sole Kiwi in the JavaFX UI controls team at Oracle, where he is the tech lead. He is responsible for the overall technical direction and API of all UI controls. In addition to this, he is also responsible for the development of a number of the UI controls himself, including the TreeView and TableView controls, as well as helping in the development of many others. Separately, Jonathan is a blogger at FXExperience.com, a website that publishes popular links, as well as news and insights into JavaFX development. He also tweets @JonathanGiles.","company":"Oracle Corp","talks":[{"title":"Hacking JavaFX TableView","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1965","presentationId":1965},{"title":"Writing Your Own JavaFX UI Controls","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1962","presentationId":1962},{"title":"Introduction to JavaFX Scenic View","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1964","presentationId":1964}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2042/thumbnail.gif?time=1376397018773","firstName":"Jonathan","tweethandle":"@JonathanGiles"},{"id":116,"lastName":"Goncalves","bio":"Antonio is a senior software architect specialized in Java/Java EE. As a consultant he advises customers in France and help them in defining their software architecture. Antonio is also the founder of the very successful Paris JUG and independent JCP member on JEE6 (JSR 316), JPA 2.0 (JSR 317) and EJB 3.1 (JSR 318). Based on all his experiences, he has written two books about Java EE 5 and recently on Java EE 6 with Glassfish. It explains, in a practical way, how to develop an application using most of the Java EE specifications.","company":"AGInc","talks":[{"title":"The second coming of JUGs","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2132","presentationId":2132},{"title":"Les Cast Codeurs Podcast","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2097","presentationId":2097}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/116/thumbnail.gif?time=1376397018791","firstName":"Antonio","tweethandle":"@agoncal"},{"id":2090,"lastName":"Gowdiak","bio":"Adam Gowdiak is the company's founder and CEO. He received M.Sc. degree in Computer Science from the Poznan University of Technology. Prior to founding Security Explorations, he had been working for Poznan Supercomputing and Networking Center and Sun Microsystems Laboratories. For over 8 years, he had been also an active member of a notable polish security research group called LSD.\r\n\r\nAdam is an experienced Java Virtual Machine hacker, with over 50 security issues uncovered in the Java technology over the recent years. He is also the hacking contest co-winner and the man who has put Microsoft Windows to its knees (vide MS03-026). He was also the first one to present successful and widespread attack against mobile Java platform in 2004.","company":"Security Explorations","talks":[{"title":"Security vulnerabilities in Java SE","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2111","presentationId":2111}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2090/thumbnail.gif?time=1376397018822","firstName":"Adam"},{"id":2077,"lastName":"Grécourt","bio":"Romain GRECOURT is a software engineer working as part of Oracle Corp in Prague. Romain is a JavaEE enthusiat and active committer of the GlassFish project.","company":"Oracle","talks":[{"title":"50 Tips in 50 Minutes for GlassFish Fans","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1549","presentationId":1549},{"title":"Developing JAX-RS Web Applications Utilizing Server-Sent Events and WebSockets","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1985","presentationId":1985}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2077/thumbnail.gif?time=1376397018838","firstName":"Romain","tweethandle":"@rgrecourt"},{"id":2085,"lastName":"Griffin","bio":"Paul Griffin is a Product Marketing Manager for Progress Software’s DataDirect Connect product line, where he is responsible for marketing activities including the customer reference program, trade show participation, sales training and web marketing activities such as webinars and web content. With nearly ten years at the company, Paul has worked in a variety of technical support and presales roles. Prior to becoming a Product Marketing Manager, he helped prospective customers thoroughly test and evaluate Progress DataDirect products. Paul is an avid blogger and enjoys writing about customer challenges, trending data topics, and the latest strategies for database connectivity. He holds a Bachelor of Science in Business Management from North Carolina State University.","company":"Progress Software","talks":[{"title":"Connecting an enterprise’s Java based reporting infrastructure to Salesforce.com data","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2106","presentationId":2106}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2085/thumbnail.gif?time=1376397018849","firstName":"Paul"},{"id":1815,"lastName":"Grigorik","bio":"Ilya Grigorik is a developer advocate and web performance engineer at Google. He spends his days and nights working on making the web faster and building and driving adoption of performance best practices.\r\n\r\nPrior to focusing on web performance Ilya was the founder and CTO of PostRank, a social analytics company which was acquired by Google and became the core of social analytics reporting within Google Analytics. Whenever not thinking web performance, or analytics, Ilya can be found contributing to open-source projects, reading, or building fun projects like VimGolf, GitHub Archive and others.","company":"Google Inc.","talks":[{"title":"Faster Websites: Crash Course on Frontend Performance","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1526","presentationId":1526},{"title":"The Chrome Dev Tools can do THAT","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1791","presentationId":1791}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1815/thumbnail.gif?time=1376397018864","firstName":"Ilya","tweethandle":"@igrigorik"},{"id":1234,"lastName":"Grinovero","bio":"Sanne Grinovero is a member of the Hibernate and Infinispan teams at JBoss by Red Hat, and a member of the London Java Community. He works on NoSQL OSS integrations, like Hibernate Search and Infinispan's integrations with Apache Lucene and Hibernate OGM. He lived in Holland, Italy, Republica Dominicana, Chile, Portugal and currently resides in London.","company":"Red Hat","talks":[{"title":"Practical guide to Infinispan Queries","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2034","presentationId":2034}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1234/thumbnail.gif?time=1376397019047","firstName":"Sanne","tweethandle":"@SanneGrinovero"},{"id":1807,"lastName":"Groeneveld","bio":"Wouter has been an enthusiastic agile software developer at Cegeka since 2007. He always tries to inspire others by showing his growing enthusiasm for dynamic languages such as Javascript. He is always eager to learn something new and focuses on professional and personal self improvement.","company":"Cegeka","talks":[{"title":"Javascript Unit testing & Build integration","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2108","presentationId":2108}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1807/thumbnail.gif?time=1376397019076","firstName":"Wouter","tweethandle":"@jefklak"},{"id":394,"lastName":"Grunwald","bio":"Gerrit is a software engineer with more than 8 years of experience in software development. He has been involved in Java desktop application developments and controls development. His current interests include JavaFX, HTML5 and Swing especially development of custom controls in one of these technologies. He is also interested in Java driven embedded technologies like Raspberry Pi and BeagleBoard. He is a true believer in open source and has participated in popular projects like JFXtras as well as his own projects (SteelSeries Swing, SteelSeries Canvas, Enzo, FXGConverter). He is an active member of the Java community, where he founded and lead the Java User Group Münster (Germany) and co leads the JavaFX community. He is an international speaker at conferences and user groups.","company":"Canoo engineering AG","talks":[{"title":"Custom controls...nothing is impossible","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1567","presentationId":1567},{"title":"JavaFX Bootstrap","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2079","presentationId":2079}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/394/thumbnail.gif?time=1376397019084","firstName":"Gerrit","tweethandle":"@hansolo_"},{"id":1101,"lastName":"Guerra Cavalcanti","bio":"Renato Guerra Cavalcanti is an independent senior analyst/developer particularly experienced in design and development of complex and multitiered applications. Having studied psychology (in Rio) and philosophy (in Paris), he started programming in 1999 to finance his studies. In 2002 he decided to dedicate himself full-time to programming.\r\n\r\nIn his free time, he is experimenting with new technologies, java frameworks and programming languages, specially Scala.\r\n\r\nIn 2011, Renato, together with Tim Romberg and Louis Jacomet, founded BeScala, the Belgium Scala Enthusiasts group with the objective to promote Scala adoption in Belgium. He's is also steering committee member of BeJUG, the Belgium Java User Group.","company":"Xavena BVBA","talks":[{"title":"Scala Enthusiasts Gathering","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1612","presentationId":1612}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1101/thumbnail.gif?time=1376397019103","firstName":"Renato","tweethandle":"@renatocaval"},{"id":60,"lastName":"Gunnarsson","bio":"Great programmers are usually lousy designers, and vice versa, but Martin is one of those rare crossbreeds who can handle both. Graphics programming and GUI design suits him particularly well, but being a true perfectionist, heʼs rarely satisfied with the results of his own work. Martin comes from a Java/Swing background, but has been working almost entirely with JavaScript and Objective-C the last few years.","company":"Epsilon Information Technology","talks":[{"title":"Having fun with Android mashups","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1811","presentationId":1811},{"title":"JavaFX Mashups","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2130","presentationId":2130}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/60/thumbnail.gif?time=1376397019291","firstName":"Martin","tweethandle":"@gunnarsson"},{"id":132,"lastName":"Guy","bio":"Romain Guy is a software engineer at Google. After spending years having fun with large UIs on the desktop and talking about them at conferences, in blogs, magazines and books, Romain decided to go for the small screen and joined the Android project, an Open Source operating system for mobile phones. He's now trying to make mobile phone UIs as fun and exciting as desktop ones.","company":"Google","talks":[{"title":"What's new with Android","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2059","presentationId":2059},{"title":"Important Android Stuff","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2060","presentationId":2060},{"title":"For Butter or Worse","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2058","presentationId":2058}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/132/thumbnail.gif?time=1376397019321","firstName":"Romain","tweethandle":"@romainguy"},{"id":129,"lastName":"Haase","bio":"Chet is a graphics geek. He has worked across the industry on various platforms and technologies that put the pixels on the screen. He worked on the Java desktop library at Sun Microsystems, on Java2D, Swing, and animation. He worked on the Flex SDK team at Adobe, writing the effects framework for Flex 4. And he now works at Google on the Android project.\r\nChet is a frequent speaker at conferences such as Devoxx and JavaOne, on topics ranging from graphics to, well, graphics.\r\nChet is the author of the book \"Flex 4 Fun,\" about the graphical and animated side of the Flex 4 SDK.\r\nChet is the co-author, with Romain Guy, of Filthy Rich Clients: Developing Animated and Graphical Effects for Java Desktop applications.\r\nFinally, and irrelevantly, Chet also wrote the book \"When I am King...\", based on his comedy blog writings at http://chetchat.blogspot.com.","company":"Google","talks":[{"title":"What's new with Android","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2059","presentationId":2059},{"title":"Important Android Stuff","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2060","presentationId":2060},{"title":"For Butter or Worse","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2058","presentationId":2058}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/129/thumbnail.gif?time=1376397019358","firstName":"Chet","tweethandle":"@chethaase"},{"id":2152,"lastName":"Hale","bio":"Ben Hale is a long time SpringSource employee working on everything from the core framework to OSGi.  Lately, he has been focused on designing  and implementing highly scalable management applications for cloud-based middleware.","company":"SpringSource","talks":[{"title":"Designing REST-ful APIs with Spring 3","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2133","presentationId":2133}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2152/thumbnail.gif?time=1376397019490","firstName":"Ben","tweethandle":"@springneb"},{"id":928,"lastName":"Haleby","bio":"Johan Haleby is a Swedish developer, speaker, and writer with a profound interest in software engineering and testability in particular. He has founded and contributed to numerous open source projects such as PowerMock, REST Assured and Awaitility and has spoken at several conferences and user groups.","company":"Jayway","talks":[{"title":"Do you REST Assured?","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1578","presentationId":1578}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/928/thumbnail.gif?time=1376397019518","firstName":"Johan","tweethandle":"@johanhaleby"},{"id":1937,"lastName":"Hales","bio":"Wesley Hales is a developer, author and speaker from Atlanta, GA. He founded and leads the second largest HTML5 User Group in the world and has been involved in UI and User Experience roles for over a decade in both startup and enterprise environments. Wesley co-founded several enterprise frameworks during his 4.5 years at JBoss by Red Hat and also served as a co-founder of the recently acquired startup, InstaOps. He is now employed by Apigee as a software developer mainly focused on UI.","company":"CNN","talks":[{"title":"HTML5 and JavaScript Web Apps","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2093","presentationId":2093},{"title":"Defragmenting mobile HTML5 web apps","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1658","presentationId":1658}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1937/thumbnail.gif?time=1376397019535","firstName":"Wesley","tweethandle":"@wesleyhales"},{"id":2051,"lastName":"Hamala","bio":"Jaromir Hamala is a Senior Consultant at C2B2 Consulting Ltd., focusing on non-functional requirements of systems. He wrote his first line of code when he was 7 years old. Since than he was always interested in \"How this system works under the hood?\"\r\n\r\nJaromir is an expert on JVM, Spring Framework and Liferay Portal.","company":"C2B2 Consulting Ltd.","talks":[{"title":"G1 Garbage Collector - Big Heaps and Low Pauses","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2039","presentationId":2039}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2051/thumbnail.gif?time=1376397019554","firstName":"Jaromir","tweethandle":"@jerrinot"},{"id":2028,"lastName":"Hariri","bio":"Hadi Hariri is a developer, speaker, podcaster and Technical Evangelist at JetBrains. His passions include software architecture and web development. Book author and frequent contributor to developer publications, Hadi has been speaking at industry events for over a decade. He is based in Spain where he lives with his wife and three sons, and runs the .NET Malaga User Group. He is also an ASP.NET MVP and ASP.NET Insider.","company":"JetBrains","talks":[{"title":"Putting Kotlin to the test","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1887","presentationId":1887},{"title":"Developers - Prima Donnas of the 21st Century","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2117","presentationId":2117}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Hadi","tweethandle":"@hhariri"},{"id":1969,"lastName":"Hausel","bio":"Peter Hausel has more than fourteen years of software engineering experience. He is obsessed with web technologies, great user experience and open source. He was an early contributor to the Play framework and now he is a member of the Play core team. He works at Typesafe.","company":"Typesafe","talks":[{"title":"Rapid Application Development with Play 2","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1732","presentationId":1732},{"title":"Play Framework - Crash Course","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1733","presentationId":1733}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1969/thumbnail.gif?time=1376397019595","firstName":"Peter","tweethandle":"@pk11"},{"id":1992,"lastName":"Hendriks","bio":"Peter works as a software architect at Info Support b.v., the Netherlands. He has over ten years’ experience working with complex Java Enterprise systems for demanding customers. Peter works as an architect for several major clients and is product owner of the Info Support ALM solution “Endeavour Java”. He is an active Dutch Java community member and presents and writes on a regular basis about Java and ALM.","company":"Info Support","talks":[{"title":"Migrating Real-World Million-Line Code Bases to Java 7: Lessons Learned","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1795","presentationId":1795}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Peter","tweethandle":"@PeterHendriks80"},{"id":2047,"lastName":"Herrnstadt","bio":"Ori Herrnstadt is co-founder and CTO of Akiban. He has been developing large-scale operational database technology for years. After experiencing the common problems of operational systems in the military, SaaS, healthcare, enterprise ERP, CRM systems and modern web applications, he started developing the Orthogonal Architecture. In 2009, he co-founded Akiban Technologies to accelerate the development of the technology into the Akiban Server.","company":"Akiban Technologies","talks":[{"title":"Introducing PersistIt: Open-source Java, Key-Value Storage that Beats Native Alternatives","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2018","presentationId":2018}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2047/thumbnail.gif?time=1376397019633","firstName":"Ori","tweethandle":"@oriherrnstadt"},{"id":2059,"lastName":"Hevery","bio":"Miško Hevery works as an Agile Coach at Google where he is responsible for coaching Googlers to maintain the high level of automated testing culture. This allows Google to do frequent releases of its web applications with consistent high quality. Previously he worked at Adobe, Sun Microsystems, Intel, and Xerox (to name a few), where he became an expert in building web applications in web related technologies such as Java, JavaScript, Flex and ActionScript. He is very involved in Open Source community and an author of several open source projects such as Angular (http://angularjs.org) and JsTestDriver (http://code.google.com/p/js-test-driver).","company":"Google","talks":[{"title":"Hackergarten Hands-On Coding Event","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1850","presentationId":1850},{"title":"Re-imagining the browser with AngularJS","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1691","presentationId":1691},{"title":"Building awesome client-side web apps with AngularJS","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1692","presentationId":1692}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2059/thumbnail.gif?time=1376397019649","firstName":"Misko","tweethandle":"@mhevery"},{"id":2102,"lastName":"Horemans","bio":"Jeroen is a hard-core java developer, advocate of good design and testable code. He embraces the KISS principle and the Agile project approach.\r\nHis current function involves coaching developers and analysts by giving courses about ‘testing and design’. Besides this, Jeroen acts as an architect on various projects. He’s a contributor of the Unitils project and a huge Spring enthusiast.","company":"Smals","talks":[{"title":"Unitils : Full stack testing solution for enterpise applications","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2122","presentationId":2122}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2102/thumbnail.gif?time=1376397019671","firstName":"Jeroen","tweethandle":"@hypernations"},{"id":1081,"lastName":"Hyndman","bio":"Richard is a Developer Advocate for Android at Google in the UK. He has enjoyed over 10 years in the mobile industry, including experience running a VC funded mobile start up, working for a large mobile operator and a few years consulting. With his J2ME and XHTML years behind him, Richard now supports Android developers bringing excellent apps to the Android Market.","company":"Google","talks":[{"title":"Android Development Code Lab","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2098","presentationId":2098}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1081/thumbnail.gif?time=1376397019893","firstName":"Richard","tweethandle":"@geekyouup"},{"id":459,"lastName":"Jacomet","bio":"Louis Jacomet has been perfecting his knowledge of enterprise Java for nearly 10 years. Initially as a developer, his role evolved over the last years as technical team leader or coach. As an avid learner, Louis is now getting to know Scala and its ecosystem as a new challenge.\r\nIn addition to the bits and bytes, Louis is interested in people management skills mandatory to create a productive project team.\r\nDiscovering Agile 5 years ago was a revelation and has underpinned all his work since, whether on an Agile project or not.\r\nLouis works in Belgium as a freelance contractor.","company":"Freelancer","talks":[{"title":"Scala Enthusiasts Gathering","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1612","presentationId":1612}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/459/thumbnail.gif?time=1376397019943","firstName":"Louis","tweethandle":"@ljacomet"},{"id":2,"lastName":"Janssen","bio":"Stephan Janssen is a serial entrepreneur that has founded several successful organizations such as the Belgian Java User Group (BeJUG) in 1996, JCS Int. in 1998, JavaPolis (now Devoxx) in 2001 and recently Parleys.com in 2006.\r\n\r\nHe has been using Java since its early releases in 1995 with experience of developing and implementing real world Java solutions in the finance and manufacturing industries.\r\n\r\nHe was selected by BEA Systems as the first European (independent) BEA Technical Director.\r\n\r\nHe has also been recognized by the Server Side as one of the 54 Who is Who in Enterprise Java 2004.\r\n\r\nSun has recognized in 2005 his efforts for the Java Community and has engaged Stephan in the Java Champion project.\r\n\r\nHe has spoken at numerous Java and JUG conferences around the world.","company":"Devoxx","talks":[{"title":"The second coming of JUGs","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2132","presentationId":2132},{"title":"JUG Leaders BOF","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1711","presentationId":1711},{"title":"Progress at Parleys.com, a Java based e-Learning platform","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2049","presentationId":2049},{"title":"Welcome & Announcements","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2092","presentationId":2092}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2/thumbnail.gif?time=1376397019986","firstName":"Stephan","tweethandle":"@Stephan007"},{"id":1950,"lastName":"Jina","bio":"Vojta is a big fan of open source and Test Driven Development. Originally from the Czech Republic, Vojta lives in California and works at Google, Mountain View. His goal is to make the development of web apps and testing more fun. Testacular is a result of this effort. When not hacking on Testacular, Vojta is a core contributor to the AngularJS project and a trumpet player.","company":"Google","talks":[{"title":"Testacular - Spectacular Test Runner for JavaScript","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1694","presentationId":1694},{"title":"Building awesome client-side web apps with AngularJS","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1692","presentationId":1692}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1950/thumbnail.gif?time=1376397020166","firstName":"Vojta","tweethandle":"@vojtajina"},{"id":1051,"lastName":"Jiricka","bio":"Petr Jiricka is a software development manager on the NetBeans IDE team at Oracle. He has more than 10 year experience delivering tools for developing web applications based on the Java EE platform, but also using other frameworks such as PHO, Ruby on Rails or Grails. His current focus is mainly on HTML5 and related client-side technologies.","company":"Oracle Corporation","talks":[{"title":"Tools for Java EE 7: Evolution or Revolution?","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1615","presentationId":1615},{"title":"TinkerForge: Integrating Fun External Devices Via Java","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2139","presentationId":2139}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1051/thumbnail.gif?time=1376397020215","firstName":"Petr","tweethandle":"@petrjiricka"},{"id":617,"lastName":"Karlsson","bio":"Mattias spends most of his time working with software development in the financial sector as well as leading a Java User Group in Stockholm, Sweden. The JUG holds 8-10 fully booked meetings per year with more then 200 participants at every meeting. Mattias has worked with OO software development since 1993. Through the years he has gained experience from many different roles, including developer, architect, team leader, coach, manager, and teacher. Mattias also wrote a chapter in the \"97 Things Every Programmer Should Know\" about Code Reviews\r\n\r\nIn his spare time, Mattias can be found playing with his children or riding his motorcycle, as well as changing underprivileged people's lives by building houses with Habitat for Humanity. Mattias leads a JUG Kiva team. Kiva is a person to person micro-loan organization. Join his effort to improve the world at http://www.kiva.org/team/jug.","company":"Avega Group","talks":[{"title":"The second coming of JUGs","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2132","presentationId":2132}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/617/thumbnail.gif?time=1376397020251","firstName":"Mattias","tweethandle":"@matkar"},{"id":1996,"lastName":"Karpushonak","bio":"Andrei Karpushonak\r\n\r\nAndrei Karpushonak is a Senior Engineer in Motorola Solutions Poland. He received M.S. in Computer Science in AGH University of Science and Technology, and M.S in History in Jagiellonian University (Krakow, Poland). With 6 years of experience in the software industry, he is an expert in design and development of Android application.","company":"Motorola Solutions","talks":[{"title":"Code injection in  Android","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1865","presentationId":1865}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1996/thumbnail.gif?time=1376397020287","firstName":"Andrei"},{"id":962,"lastName":"Keil","bio":"Werner Keil is Build Manager at Maersk after working as Agile Coach, Principal Consultant and Distinct Architect for a Financial Services company and emergn, an Agile consultancy specialized in Value, Flow and Quality. Helping Global 500 Enterprises across industries like Mobile/Telco, Web 2.0, Finance, Travel/Logistics, Automotive, Healthcare, Environment & Public Services, as well as IT vendors like Oracle or IBM. Among his earlier clients are Sony where he designed and implemented micro-format based tags its online music portals.\r\n\r\nHe has worked for more than 22 years as a project manager, software architect, analyst and consultant on leading-edge technologies for Banking, Insurance, Telco/Mobile, Media and Public sector. Werner develops enterprise systems using Java, JEE, Oracle, IBM or Microsoft, does Web design and development using Adobe,Ajax/JavaScript, dynamic or functional languages.\r\n\r\nBesides working for major companies, he runs his own creative and talent agency Creative Arts & Technologies and in his spare time, runs and supports open-source projects, writes song lyrics, novels, screenplays and technical articles.\r\n\r\nWerner is Committer at Eclipse Foundation, Babel Language Champion, UOMo Project Lead and active member of the Java Community Process, including Spec Lead of JSR 357 (Social Media) and membership in JSRs like 321 (Trusted Java), 331 (CP), 333 (JCR), 342 (Java EE 7), 344 (JSF 2.2), 346 (CDI  1.1), 348/355 (JCP.next), 350 (Java State), 351 (Java Identity) or 354 (Money) and the Executive Committee.","company":"Creative Arts & Technologies","talks":[{"title":"Java Social JSR, it's alive","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2086","presentationId":2086}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/962/thumbnail.gif?time=1376397020318","firstName":"Werner","tweethandle":"@wernerkeil"},{"id":919,"lastName":"Kim","bio":"Frank Kim is the founder and principal consultant with ThinkSec as well as the curriculum lead for application security at the SANS Institute. Frank has over 14 years of experience in software development, information technology, and security. He has designed and developed applications for large healthcare, technology, insurance, and consulting companies. Frank currently focuses on security strategy and application security program development with a special interest in integrating security into the software development life cycle. Frank is the author of the SANS Institute's Secure Coding in Java course. He has spoken internationally at events like JavaOne, Devoxx, Jazoon, and UberConf and was recently named a JavaOne Rock Star.","company":"ThinkSec","talks":[{"title":"Defensible Development with Secure HTTP Headers","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1570","presentationId":1570}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/919/thumbnail.gif?time=1376397020341","firstName":"Frank","tweethandle":"@thinksec"},{"id":2034,"lastName":"King","bio":"Gavin King leads the Ceylon project at Red Hat. Gavin is the creator of Hibernate, a popular object/relational persistence solution for Java, and the Seam Framework, an application framework for enterprise Java.","company":"Red Hat","talks":[{"title":"Write your first Ceylon program with the language authors","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1914","presentationId":1914},{"title":"Exploring Ceylon in Eclipse","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2140","presentationId":2140}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Gavin"},{"id":1083,"lastName":"Kinlan","bio":"Paul is a Developer Advocate on Google Chrome and he focuses on HTML5, open web technologies and the Chrome Web Store. He is passionate about working closely with developers to help them bring awesome applications to the web (because that is the future). Prior to Google he used to earn a living off building apps that used Google's Infrastructure - and whilst he wasn't doing that he built Fraud Detection applications for the worlds largest telecoms, banking and insurance companies.","company":"Google","talks":[{"title":"The next evolution of apps with Chrome","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2048","presentationId":2048}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1083/thumbnail.gif?time=1376397020528","firstName":"Paul","tweethandle":"@Paul_Kinlan"},{"id":2066,"lastName":"Knoernschild","bio":"Kirk is a software developer with a passion for building great software. He takes a keen interest in design, architecture, application development platforms, agile development, and the IT industry in general, especially as it relates to software development. His recent book, \"Java Application Architecture: Modularity Patterns with Examples Using OSGi\" was published in 2012 and presents 18 patterns that help you design modular software systems.","company":"Gartner","talks":[{"title":"Modular Architecture Today","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2077","presentationId":2077},{"title":"Architecture All the Way Down","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2078","presentationId":2078}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2066/thumbnail.gif?time=1376397020544","firstName":"Kirk","tweethandle":"@pragkirk"},{"id":166,"lastName":"Knutsen","bio":"JBoss, Red Hat - Arquillian project lead Aslak Knutsen is currently a Senior Software Engineer at JBoss, by Red Hat where he is working on projects such as Arquillian, ShrinkWrap, Weld and Seam 3, one of the founders of the JBoss Testing initiative and a speaker at major industry conferences including Devoxx, Jazoon, JFokus, Geecon, JUDCon and JBoss World. Previously, Aslak was a Senior Consultant at Conduct AS (working with JBoss related technologies) and Senior Developer at EDB ASA (working with electronic billing/banking systems).","company":"Red Hat","talks":[{"title":"The bugs are building another Death Star","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2129","presentationId":2129}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/166/thumbnail.gif?time=1376397020553","firstName":"Aslak"},{"id":2087,"lastName":"Kohler","bio":"Damon Kohler has been a software engineer at Google for over six years. He currently lives and works in Munich, Germany where he is exploring robust SLAM and ways to make robotics more accessible through integration with cloud services. He created Scripting Layer for Android (SL4A) which is used by thousands of developers to write and run Python scripts on Android. More recently, in collaboration with Willow Garage, he created rosjava, bringing ROS to Android and allowing roboticists to leverage powerful new mobile devices.","company":"Google","talks":[{"title":"Cloud Robotics","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2109","presentationId":2109}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Damon"},{"id":2135,"lastName":"Kölling","bio":"Michael Kölling is a Professor at the School of Computing, University of Kent, in Canterbury, UK. He holds a PhD in computer science from Sydney University, and has worked in Australia, Denmark and the UK. Michael’s research interests are in the areas of object-oriented systems, programming languages, software tools, computing education and HCI. He has published numerous papers on object-orientation and computing education topics and is the author of two Java textbooks. Michael is the lead developer of BlueJ and Greenfoot, two educational programming environments. In 2008, Michael was awarded a National Teaching Fellowship by the Higher Education Academy.","company":"University of Kent","talks":[{"title":"Getting kids to code with Java and Greenfoot","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2125","presentationId":2125}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2135/thumbnail.gif?time=1376397020598","firstName":"Michael","tweethandle":"@michaelkolling"},{"id":1933,"lastName":"Kotamraju","bio":"Jitendra Kotamraju is a Principal Member of Technical Staff at Oracle. He has been contributing to the many Java EE technologies and GlassFish projects for the last 8 years. He was the specification and implementation lead of JAX-WS 2.2. At present, he is the specification lead of JSR 353:Java API for JSON Processing and also implementing various web technologies like SSE, and WebSocket in GlassFish.","company":"Oracle","talks":[{"title":"JSR 356 : The Java API for WebSocket","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2104","presentationId":2104},{"title":"Developing JAX-RS Web Applications Utilizing Server-Sent Events and WebSockets","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1985","presentationId":1985},{"title":"JSR 353 : Java API for JSON Processing","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1644","presentationId":1644}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1933/thumbnail.gif?time=1376397020791","firstName":"Jitendra"},{"id":2067,"lastName":"Kreuzer","bio":"Kai Kreuzer is a Java and OSGi expert and a Home Automation enthusiast. He works as a Developer Evangelist in the Connected Home department of Deutsche Telekom AG. In his spare time he automates all aspects of his house – for which he founded the openHAB project early in 2010.","company":"openHAB.org","talks":[{"title":"Home Automation for Geeks","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2075","presentationId":2075}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2067/thumbnail.gif?time=1376397021008","firstName":"Kai","tweethandle":"@openHAB"},{"id":1904,"lastName":"Kurka","bio":"Daniel Kurka is a member of the Google Web Toolkit steering committee that decides on the future of GWT development. He is also a master committer to GWT. In 2009 he started two open source projects for building mobile apps with GWT and Phonegap: mgwt (http://www.m-gwt.com) and gwt-phonegap.\r\nThese frameworks have become the standard for building mobile apps with GWT.","company":"mgwt","talks":[{"title":"mgwt - GWT goes mobile","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1974","presentationId":1974},{"title":"mobile apps are a dead-end","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1980","presentationId":1980}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1904/thumbnail.gif?time=1376397022214","firstName":"Daniel","tweethandle":"@dankurka"},{"id":1775,"lastName":"Ladd","bio":"Seth is a web engineer and is a Chrome Developer Advocate, helping developers of all sizes launch awesome modern web apps with Dart. He produced Aloha on Rails, the Hawaii Ruby on Rails and Web Development Conference, and New Game, the conference for HTML5 game developers. Way back, Seth co-authored the Expert Spring MVC book. More recently, he helped release Angry Birds for the web. Seth is on the board of the Academy of Interactive Arts and Sciences.","company":"Google","talks":[{"title":"Putting the App back into Web Apps : Building the modern web with Dart","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1490","presentationId":1490}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1775/thumbnail.gif?time=1376397022699","firstName":"Seth","tweethandle":"@sethladd"},{"id":6,"lastName":"Laforge","bio":"Guillaume Laforge is the project lead of Groovy, the highly popular and successful dynamic language for the JVM. He co-authored Manning's best seller \"Groovy in Action\" with Dierk König, and is working for SpringSource (a division of VMWare) where he's hacking full time on cool and Groovy stuff. You can meet Guillaume at conferences around the world where he evangelizes the Groovy dynamic language, Domain-Specific Languages in Groovy, the agile Grails web framework or the Gaelyk lightweight toolkit for Google App Engine.","company":"SpringSource","talks":[{"title":"What's new in Groovy 2.0?","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1792","presentationId":1792},{"title":"Les Cast Codeurs Podcast","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2097","presentationId":2097}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/6/thumbnail.gif?time=1376397022733","firstName":"Guillaume","tweethandle":"@glaforge"},{"id":2094,"lastName":"Lagergren","bio":"Marcus Lagergren has an MSc in computer science from the Royal Institute of Technology in Stockholm, Sweden. Lagergren has a background in computer security but has worked with runtimes since 1999. He was one of the founding members of Appeal Virtual Machines, the company that developed the JRockit JVM, which was bought by BEA Systems in 2002. Lagergren has been team lead and architect for the JRockit code generators and has been involved in most other aspects of JVMs over the years. From 2007 to 2010 he worked for Oracle on fast virtualization technology, and since late 2011 has been a member of the Oracle langtools team, investigating dynamic languages on the JVM. Lagergren is also a general runtime futurist, and co-author of the book Oracle JRockit: The Definitive Guide, which, despite the product-centric title, has been praised as the best book ever written on JVM internals in general.","company":"Oracle","talks":[{"title":"Nashorn: Optimizing JavaScript and Dynamic Language Execution on the JVM","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2115","presentationId":2115}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2094/thumbnail.gif?time=1376397022779","firstName":"Marcus","tweethandle":"@lagergren"},{"id":242,"lastName":"Lahoda","bio":"In software business since 1985, designed a large number of successful solutions for various needs and customers. Last decade spend writing mobile applications, focusing on Android and iOS platforms lately. Besides creating mobile software for clients that seen more that three millions of downloads in 2011 alone, Pavel is creator of Android programming framework ObjectForms (http://www.objectforms.com) which is his contribution to eradicate chevronitis disease.\r\n\r\nPavel blogs regularly at http://blog.perpetumdesign.com and can be found on Twitter as perpetumdesign","company":"Actiwerks Ltd.","talks":[{"title":"Android Burning Questions","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1993","presentationId":1993}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/242/thumbnail.gif?time=1376397022790","firstName":"Pavel","tweethandle":"@perpetumdesign"},{"id":1440,"lastName":"Landelle","bio":"Stéphane is the eBusiness Information CTO, a french JEE consulting company, part of the Excilys Group.\r\nHe's been having fun playing with the Java ecosystem for 12 years, but Scala and Akka bring fun to a higher level.\r\nHe's the founder and the technical leader of the Gatling stress tool project.","company":"eBusiness Information, Excilys Group","talks":[{"title":"Blast your webapp with Gatling","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1860","presentationId":1860}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1440/thumbnail.gif?time=1376397022799","firstName":"Stéphane","tweethandle":"@GatlingTool"},{"id":37,"lastName":"Leau","bio":"Costin is Staff Engineer at SpringSource, VMware. His interests include data access and aspect oriented programming. With significant development experience, Costin is involved in the development of Spring framework (authored the Spring 3.1 caching abstraction) and Spring Data. Led Spring Dynamic Modules (Spring OSGi) project and the Spring-inspired, OSGi 4.2 Blueprint Service RI. \r\nCurrently working with NoSQL and Big Data technologies, leading Spring Redis and Spring Hadoop projects. \r\nSpeaker at various editions of EclipseCon/OSGi DevCon, JavaOne, Devoxx/Javapolis, JavaZone, SpringOne, SpringOne2GX, TSSJS, TSE on Java/Spring/OSGi/Hadoop related topics","company":"SpringSource, division of VMware","talks":[{"title":"How to build Big Data Pipelines for Hadoop using OSS","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1565","presentationId":1565}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/37/thumbnail.gif?time=1376397022847","firstName":"Costin","tweethandle":"@costinl"},{"id":2080,"lastName":"Ledbrook","bio":"Peter is a long time Java developer, Grails user, core committer, plugin author, and co-author of the book Grails in Action with Glen Smith.\r\n\r\nWith a passion for how new technology can help developers get stuff done, he has the good fortune to speak regularly at conferences about Grails and Cloud Foundry on behalf of VMware and engage with those communities. This comes on top of more than 10 years experience in software development, from C to pure servlet development, to modern web apps.","company":"VMWare","talks":[{"title":"What's new in Grails 2.x?","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2102","presentationId":2102}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2080/thumbnail.gif?time=1376397022856","firstName":"Peter","tweethandle":"@pledbrook"},{"id":2062,"lastName":"Lee","bio":"Square's CTO Bob Lee is a hands on technical leader, engineering everything from smartphone apps, to DSP algorithms, to embedded firmware, to payments processing infrastructure. Prior to Square, Bob led the development of Android's core libraries at Google. He created the Jolt award-winning Guice framework. He co-authored the bestselling book \"Bitter EJB.\" He leads the specification of JSR-330 \"Dependency Injection for Java,\" and he's a member of the JSR-335 \"Lambda expressions\" and JSR-166 \"Concurrency Utilities\" expert groups.","company":"Square","talks":[{"title":"Engineering Elegance: The Secrets of Square's Stack","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2066","presentationId":2066}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2062/thumbnail.gif?time=1376397022864","firstName":"Bob","tweethandle":"@crazybob"},{"id":11,"lastName":"Leenders","bio":"Gert Leenders is working as a JavaEE Architect at Axi Nv where he started his career in 2001 as a .NET developer specializing in GDI+ Development. After 2 years he traded the .NET platform for Java J2EE development.\r\n\r\nMore and more convinced of RAD's potential he joined a team at Axi with the goal to develop an RAD Framework/Generator on top of the J2EE platform for faster, more reliable and maintainable web applications (Framework name: Jaxx). In 2005 Roeland Saels and he participated in the JavaPolis RAD Race with the JAXX Framework, which resulted in a shared first place.","company":"Parleys","talks":[{"title":"NFC, Arduino, Raspberry PI, Android and NodsJS Case-Study","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2083","presentationId":2083}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/11/thumbnail.gif?time=1376397022912","firstName":"Gert","tweethandle":"@glnds"},{"id":240,"lastName":"Lehtinen","bio":"Dr. Joonas Lehtinen is the founder of Vaadin project, a Java-based framework for building business-oriented Rich Internet Applications. Joonas has been developing applications for the web since 1995 with a strong focus on Ajax and Java. He is the founder and CEO of the company behind the Vaadin framework and is a frequent speaker at international conferences.","company":"Vaadin Ltd.","talks":[{"title":"Vaadin 7","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1724","presentationId":1724}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/240/thumbnail.gif?time=1376397022948","firstName":"Joonas","tweethandle":"@joonaslehtinen"},{"id":1406,"lastName":"Linsolas","bio":"Développeur Java depuis le début du siècle, Romain est passionné par le développement informatique, et tout son univers.\r\nEmployé par le CNRS sur un projet d'astrophysique, puis consultant chez Valtech et enfin développeur / leader technique / architecte technique pour la Société Générale, Romain est aussi impliqué dans la communauté de developpez.com en tant que rédacteur et modérateur.\r\nPassionné également par les principes de l'intégration continue, il n'a de cesse d'améliorer et d'automatiser les processus au sein des équipes pour lesquelles il travaille.","company":"Société Générale","talks":[{"title":"Easy Entity Auditing with Hibernate Envers","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1946","presentationId":1946}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1406/thumbnail.gif?time=1376397022981","firstName":"Romain","tweethandle":"@romaintaz"},{"id":2096,"lastName":"Little","bio":"Dr. Mark Little leads JBoss technical direction, research and development. Prior to this he was SOA technical development manager, and director of standards. He was chief architect and co-founder at Arjuna Technologies, and Distinguished Engineer at Hewlett Packard when Arjuna was spun off. He has worked in the area of reliable distributed systems since the mid-80s. His PhD was on fault-tolerant distributed systems, replication and transactions. He is currently also a professor at Newcastle University.","company":"Red Hat","talks":[{"title":"JBoss Announcement","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2120","presentationId":2120}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2096/thumbnail.gif?time=1376397023026","firstName":"Mark","tweethandle":"@nmcl"},{"id":921,"lastName":"Long","bio":"Josh Long is the Spring developer advocate. Josh is the author of books from Apress, O'Reilly and Manning, and a SpringSource committer and contributor. When he's not hacking on code, he can be found at the local Java User Group or at the local coffee shop. Josh likes solutions that push the boundaries of the technologies that enable them. His interests include scalability, BPM, grid processing, mobile computing and so-called \"smart\" systems. He blogs at blog.springsource.org or joshlong.com.","company":"SpringSource","talks":[{"title":"The Spring BOF","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2056","presentationId":2056},{"title":"The Cloud Foundry Quickie: 10 minutes from Concept to Deployment","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2053","presentationId":2053},{"title":"Spring 3.2 and 3.2 Themes and Trends","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2134","presentationId":2134}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/921/thumbnail.gif?time=1376397023044","firstName":"Josh","tweethandle":"@starbuxman"},{"id":2002,"lastName":"Luković","bio":"Software Developer @ SOL Software","company":"SOL Software","talks":[{"title":"FastOQL - Fast Object Queries for Hibernate","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1932","presentationId":1932}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2002/thumbnail.gif?time=1376397023051","firstName":"Srđan"},{"id":2159,"lastName":"Lynch","bio":"Program Manager for Middleware Services UK&I at Red Hat.","company":"Red Hat","talks":[{"title":"Will you map/reduce my cloud?  My data's getting big. (part 2/2)","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2127","presentationId":2127},{"title":"Will you map/reduce my cloud?  My data's getting big","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2126","presentationId":2126}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Keith"},{"id":747,"lastName":"Majsak","bio":"Bartosz Majsak works as a software developer and consultant at Cambridge Technology Partners based in Zurich. He is a passionate about open source technologies and testing methodologies. In the spare time he is contributing to open source projects and writing technical articles. He is a JBoss Arquillian team member and lead of two modules - Persistence Extension which makes writing database oriented tests even easier and Spock Test Runner which gives your Arquillian tests some BDD and Groovy love. One thing which might prove that he is not a total geek is his addiction to alpine skiing.He used to play Go game.","company":"Cambridge Technology Partners","talks":[{"title":"Testing Java Persistence Layer Done Right with Arquillian","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1558","presentationId":1558}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/747/thumbnail.gif?time=1376397023095","firstName":"Bartosz","tweethandle":"@majson"},{"id":814,"lastName":"Markus","bio":"Mircea Markus is a principal R&D engineer at JBoss, a division of Red Hat, since 2007. He has been working on various clustering components, such as JBossCache, PojoCache or JGoups. He is one of the founders and project lead of Infinispan on on which he has been concentrating his efforts for the last three years. He is also the founder of project Radargun (a benchmarking framework for data grids) and represents Red Hat on the Expert Group of JSR 350 (Java State Management).","company":"redhat","talks":[{"title":"Measuring performance and capacity planning in Java-based data grids","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1934","presentationId":1934}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/814/thumbnail.gif?time=1376397023104","firstName":"Mircea"},{"id":1414,"lastName":"Massol","bio":"Vincent is the CTO of XWiki SAS and an active committer of the XWiki open source project. Before being paid to work on open source he spent over 10 years working nights and week ends having fun on various open source projects (committer on Apache Maven, creator of Apache Cactus and Codehaus Cargo to name a few). \r\n\r\nVincent also co-authored 3 books: JUnit in Action , Maven: A Developer's Notebook and Better Builds with Maven. He's a regular speaker at IT and Java conferences and also a member of LesCastCodeurs podcast, a French podcast focusing on news in the Java world at large.\r\n\r\nVincent lives in the countryside in France, enjoying life with his wife Marie-Albane and his 3 boys Pierre-Olivier, Jean and Paul. When not watching his lawnmower robot do its work, he likes playing Tennis...","company":"XWiki SAS","talks":[{"title":"Application within Minutes","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1917","presentationId":1917},{"title":"Les Cast Codeurs Podcast","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2097","presentationId":2097}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Vincent","tweethandle":"@vmassol"},{"id":2083,"lastName":"Merejkowsky","bio":"After 3 years in an engineering school in France, Dimitri arrived at Aldebaran Robotics for his final internship.\r\nDuring 3 mouths, he worked with Python and C++ to implement an emerging walk algorithm with genetic algorithms and neural networks.\r\nAt the end, he was hired, and since then he moved from A.I. to lower level tools.\r\nHe’s now in charge of the continuous integration, and the releases of the various SDKs (C++, Python, Java) produced by Aldebaran.\r\nHe also works on qibuild, a generic build system from C++, with lots of ideas borrowed from Maven :)\r\nHe’s currently working on a proper Android SDK for NAO. (Making Android applications for NAO is possible but a bit tedious right now ...)","company":"Aldebaran Robotics","talks":[{"title":"Using Java for robotics with Aldebaran's humanoid robot NAO","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2107","presentationId":2107}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2083/thumbnail.gif?time=1376397023226","firstName":"Dimitri"},{"id":2003,"lastName":"Mijailović","bio":"Software Engineer, Senior Java EE Developer.\r\nPhD Candidate at School of  Electrical Engineering, University of Belgrade.\r\nInvolved in development of SOLoist4 framework (soloist4uml.org) for model-driven development of information systems.\r\nInvolved in development of 10 large to medium information systems.\r\nCreator of the FastOQL.","company":"SOL Software","talks":[{"title":"FastOQL - Fast Object Queries for Hibernate","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1932","presentationId":1932}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Žarko"},{"id":58,"lastName":"Milicev","bio":"Dr. Dragan Milicev is Associate Professor at the University of Belgrade, Faculty of Electrical Engineering, Department of Computing (www.etf.rs). He is specialized in software engineering, model-driven development, UML, object-oriented programming, software architecture and design, and information systems. He has published papers in some of the most prestigious scientific and professional journals and magazines (including IEEE Transactions on Software Engineering), contributing to the theory and practice of model-driven development and UML. He is also a member of the program committees of two most prestigious international conferences on model-based engineering (MODELS and ECMFA). \r\nHe is the author of the book “Model-Driven Development with Executable UML,” published in English by Wiley/Wrox and also translated to Chinese. The book has brought out some original ideas and improvements to the field of rapid model-based development of information systems. \r\nWith more than 25 years of extensive industrial experience in building complex commercial software systems, he has been serving as the chief software architect, project manager, or consultant in a few dozen international projects. \r\nHe is the founder of SOL Software (www.sol.rs), a software research and development company specialized in designing software development tools using model-driven approach, as well as in building custom applications and systems. He is the chief architect of SOLoist (www.soloist4uml.com), a rapid model-driven application development framework for information systems, based on an executable UML and Java.","company":"University of Belgrade, Faculty of Electrical Engineering","talks":[{"title":"FastOQL - Fast Object Queries for Hibernate","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1932","presentationId":1932}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/58/thumbnail.gif?time=1376397023273","firstName":"Dragan"},{"id":1949,"lastName":"Minar","bio":"Igor Minar is a software engineer at Google. He is a co-lead of the AngularJS project that aims to bring simplicity to the development of client-side web development via declarative markup, data-binding, and APIs with testability baked in. In his previous life, Igor was a hardcore server-side developer at Sun Microsystems specializing in test-driven web development with Java, JavaEE, JRuby and Rails.","company":"Google","talks":[{"title":"Hackergarten Hands-On Coding Event","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1850","presentationId":1850},{"title":"Re-imagining the browser with AngularJS","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1691","presentationId":1691},{"title":"Building awesome client-side web apps with AngularJS","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1692","presentationId":1692}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1949/thumbnail.gif?time=1376397023282","firstName":"Igor","tweethandle":"@IgorMinar"},{"id":183,"lastName":"Moussine-Pouchkine PR","bio":"Developer Relations at Google","company":"Google","talks":[{"title":"What's new with Google App Engine and Compute Engine?","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1784","presentationId":1784}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/183/thumbnail.gif?time=1376397023291","firstName":"Alexis","tweethandle":"@alexismp"},{"id":1069,"lastName":"Murray","bio":"Technical Director at encription limited.  A CESG CHECK Green Light company providing penetration testing services to Government, the nuclear industry as well as MoD clients.\r\n\r\nDirector of the TigerScheme, secretary to the Technical Panel, member of the management committee and soon to succeed as Chair of the Technical Panel.  \r\n\r\n“The Tiger Scheme provides a means of independently certifying the skills of vulnerability test (penetration test) engineers.  Our qualifications and memberships are graduated and progressive, ranging from Associate Membership to the Senior Security Tester qualification which has been assessed by CESG as equivalent to the CHECK Team Leader Assault Course.”\r\n\r\n44con [ www.44con.com ] crew and industry liaison officer.","company":"Encription Limited","talks":[{"title":"An analysis of CVE-2012-2122, MySQL authentication","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2087","presentationId":2087}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1069/thumbnail.gif?time=1376397023337","firstName":"Cambell"},{"id":1965,"lastName":"Naftalin","bio":"Maurice Naftalin is a software architect with Incept5.  He has been a developer, researcher and teacher in the software industry for several decades.  He is co-author of \"Java Generics and Collections\", and is looking forward to introducing closures in a new edition.","company":"Morningside Light Ltd","talks":[{"title":"Closures and Collections - the World After Eight","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2044","presentationId":2044}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1965/thumbnail.gif?time=1376397023355","firstName":"Maurice","tweethandle":"@mauricenaftalin"},{"id":1062,"lastName":"Norbye","bio":"Tor Norbye is an engineer on the Android SDK team working on visual tools for Android development. Prior to Google he worked on tools for 14 years at Sun Microsystems.","company":"Google","talks":[{"title":"What's New in Android Developers’ Tools","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2090","presentationId":2090},{"title":"Android Tools in Action","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2085","presentationId":2085},{"title":"JavaPosse LIVE","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2084","presentationId":2084}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1062/thumbnail.gif?time=1376397023365","firstName":"Tor","tweethandle":"@tornorbye"},{"id":2046,"lastName":"O'Brien","bio":"Tim O’Brien has written several Java books for O’Reilly including Jakarta Commons Cookbook, and Maven: The Definitive Guide, in addition to co-authoring Maven: A Developer’s Notebook and Harnessing Hibernate.   He also covers Java-related topics for O’Reilly Radar and focuses on build tools and emerging Java technologies.   In addition to writing, Tim has served as a writer and consultant to Sonatype, Inc. writing Maven: The Complete Reference and Maven by Example.   He has been a consultant to Forbes, Inc., Consumer Reports, Scholastic, Inc., and Gleanster in addition to contributing to open source software.","company":"O'Reilly Media, Inc","talks":[{"title":"A Decade of Shipwrecks: The Past, Present, and Future of Builds","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2027","presentationId":2027},{"title":"Introducing PersistIt: Open-source Java, Key-Value Storage that Beats Native Alternatives","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2018","presentationId":2018}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2046/thumbnail.gif?time=1376397023411","firstName":"Tim","tweethandle":"@tobrien"},{"id":1997,"lastName":"Offermans","bio":"Marcel is a Fellow at Luminis and leads the competence center for OSGi at Luminis Technologies. He is also a Member of the Apache Software Foundation and involved as a committer and PMC member in the Apache Felix, Apache ACE and Apache Celix projects. As a software architect he has a broad experience in different operating systems, languages and applications, ranging from enterprise applications to mobile, embedded and distributed systems. He has been involved in lots of commercial OSGi projects for over ten years and is an expert at architecting modular systems. He is currently working on Amdatu, an open source, cloud based platform. Marcel regularly speaks at conferences, including ApacheCon, EclipseCon, JavaOne, OSGi DevCon, FOSDEM, Devoxx, NLJUG and various local demo camps and user forums and has given several hands-on trainings on OSGi related subjects.","company":"Luminis Technologies","talks":[{"title":"Building Modular Enterprise Applications in Java","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1812","presentationId":1812}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1997/thumbnail.gif?time=1376397023439","firstName":"Marcel","tweethandle":"@m4rr5"},{"id":126,"lastName":"Ozturk","bio":"Talip Ozturk is the founder of Hazelcast. He has been working with enterprise Java since 1999. In 2003, he got fascinated by Jini and developed an implementation of JavaSpaces. In 2008, his passion for distributed programming led him to develop Hazelcast, an open source clustering and highly scalable data distribution platform for Java. Before Hazelcast, he was the director of technology at Zaman Media Group.","company":"Hazelcast","talks":[{"title":"Clustering your application with Hazelcast","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2118","presentationId":2118}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/126/thumbnail.gif?time=1376397023465","firstName":"Talip","tweethandle":"@oztalip"},{"id":1420,"lastName":"Paumard","bio":"José is an assistant professor at the Institut Galilée (Université Paris 13) and a PhD in applied mathematics from the ENS Cachan. He has discovered the Java language in 1995, and has been teaching at the university since 2000. For about 10 years, José has been working with several research teams in archeology and ancient near east history. He has been the co-director\r\nof the MAVI project, held by the Collège de France (http://www.museum-achemenet.college-de-france.fr/), and published Open melodie (http://www.openmelodie.org /), an open source project on the Java platform, that acts as a back office for the MAVI.\r\n\r\nJosé also publishes \"Java le soir\", a technical blog in french (http://blog.paumard.org/), with about 700 pages of courses about Java / JEE in open access. José also contributes regularly to numerous technical projects in a variety of areas.\r\n\r\nHe is also a member of the french Paris Java User Group, and one of the organizer of Devoxx France.","company":"Devoxx France","talks":[{"title":"From Runnable and synchronized() to parallel() and atomically()","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1701","presentationId":1701},{"title":"Fork / Join, lambda & parallel() : parallel computing made (too ?) easy","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1702","presentationId":1702}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1420/thumbnail.gif?time=1376397023481","firstName":"José","tweethandle":"@JosePaumard"},{"id":1839,"lastName":"Peer","bio":"Developing in Java since 2003, I have experience in a variety of server side technologies, and built several useful components.\r\nI am working for RSA, the security division of EMC, in Israel since 2004. Today I am a core developer and consultant building a statistical prediction engine used in numerous products and services.\r\nI maintain a technical blog http://odedpeer.blogspot.com/ with out of the ordinary issues I dealt with.","company":"RSA, the security division of EMC","talks":[{"title":"Building application components with monitoring in mind","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1569","presentationId":1569}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1839/thumbnail.gif?time=1376397023532","firstName":"Oded","tweethandle":"@odpeer"},{"id":355,"lastName":"Pepperdine","bio":"Kirk Pepperdine works as an independent consultant offering Java performance-related services. Prior to focusing on Java, Kirk developed and tuned systems written in C/C++, Smalltalk, and a variety of other languages. Kirk has written many articles and spoken at several conferences on the subject of performance tuning. He helped evolve http://www.javaperformancetuning.com as a resource for performance tuning tips and information.","company":"Kodewerk Ltd","talks":[{"title":"Performance Optimization Methodology","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2033","presentationId":2033}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/355/thumbnail.gif?time=1376397023551","firstName":"Kirk","tweethandle":"@javaperftuning"},{"id":841,"lastName":"Peters","bio":"Sven is software geek working as an ambassador for Atlassian in Germany. He has been developing JavaEE applications for over 12 years and leading small teams using lean methodologies. Sven likes well written and readable source code and cares about the motivation of software developers.","company":"Atlassian","talks":[{"title":"7 Things: How to make good teams great","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1595","presentationId":1595}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/841/thumbnail.gif?time=1376397023582","firstName":"Sven","tweethandle":"@svenpet"},{"id":937,"lastName":"Phillips","bio":"Andrew is VP of Products for XebiaLabs, providers of the industry-leading release automation solution, Deployit. Andrew is a cloud, service delivery and automation expert and has been part of the shift to more automated application delivery platforms. \r\n\r\nIn his spare time as a developer, he worked on Multiverse, the open-source STM implementation, contributes to Apache jclouds, the leading cloud library and co-maintains the Scala Puzzlers site.","company":"jclouds","talks":[{"title":"Scala Puzzlers","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1492","presentationId":1492}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/937/thumbnail.gif?time=1376397023697","firstName":"Andrew"},{"id":1560,"lastName":"Ploski","bio":"Ray Ploski is an international speaker and evangelist for JBoss technologies.  Ray is responsible for JBoss developer engagement worldwide.  Prior to his current role he worked as a core-contributor, consultant, trainer, and solution architect at JBoss.  He has helped many of the top 100 global corporations worldwide adopt open source. Ray has worked with Java since its initial 1.0 release and has his degree from University of Illinois.  He currently resides in Chicago but has a passion for surfing with his wife on Maui.","company":"Red Hat","talks":[{"title":"A Whirlwind Tour JBoss","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2138","presentationId":2138},{"title":"JBoss Announcement","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2120","presentationId":2120}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1560/thumbnail.gif?time=1376397023746","firstName":"Ray","tweethandle":"@rayploski"},{"id":1246,"lastName":"Potociar","bio":"Marek Potociar is a Principal Software Engineer at Oracle. He's been involved with web services development for the last nine years. At present, Marek is a specification lead of Java EE RESTful Web Services API (JAX-RS) as well as the development lead project Jersey, that provides reference implementation of JAX-RS as well as many RESTful service and client extensions. Previous to this role Marek was leading development on Metro - The open-source SOAP web services framework for Java.","company":"Oracle","talks":[{"title":"JAX-RS 2.0 Status & Directions","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1668","presentationId":1668},{"title":"The present and the future of JAX-RS and Jersey","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1633","presentationId":1633},{"title":"Developing JAX-RS Web Applications Utilizing Server-Sent Events and WebSockets","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1985","presentationId":1985}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1246/thumbnail.gif?time=1376397023755","firstName":"Marek","tweethandle":"@marek_potociar"},{"id":2025,"lastName":"Potter","bio":"Priit (founder and CEO of Plumbr) has first-hand experience from different stages in software development: in the 10 years prior to joining Plumbr he worked as a system analyst, project manager, team lead, and a solution architect with the biggest IT projects in the region. Sometimes he even enjoys occasional hacking himself - like creating an Excel file that displays real time funnel info from our customer database!","company":"Plumbr","talks":[{"title":"How to solve memory leaks within minutes with Plumbr","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1882","presentationId":1882}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2025/thumbnail.gif?time=1376397023774","firstName":"Priit","tweethandle":"@priitpotter"},{"id":317,"lastName":"Potts","bio":"Jasper Potts is the Developer Experience Architect for the Java Client Group at Oracle. Responsible for making Java Client Cool. Formally a lead engineer on the JavaFX & Swing teams working on the new JavaFX UI Controls and Graphics frameworks. Also responsible for designing, developing and presenting demos during the keynotes at JavaOne and Devoxx. A JavaOne Rockstar presenter having presented many sessions on JavaFX and Swing at many conferences. Prior to Sun he founded Xerto a desktop applications company developing Imagery a Java professional photo management application.","company":"Oracle","talks":[{"title":"Building Amazing Applications with JavaFX","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1636","presentationId":1636},{"title":"What’s New in JavaFX","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1637","presentationId":1637}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/317/thumbnail.gif?time=1376397023841","firstName":"Jasper","tweethandle":"@jasperpotts"},{"id":2158,"lastName":"Poutsma","bio":"Arjen Poutsma is a Staff Engineer at SpringSource (a division of VMware) with more than fifteen years' experience in commercial software environments. During this time he has worked with both Java EE and Microsoft .NET.\r\n\r\nIn 2004, Arjen started to specialise in Web Services and Service Oriented Architectures. During this period he has conducted trainings and has researched SOAs in large organisations.\r\n\r\nArjen is the founder and the project lead for the Spring Web Services. This Spring project aims at facilitating development of document-driven web services. He worked on the REST support in Spring 3.0 and 3.1. Recently, Arjen started the Spring Scala project, aimed to make using Spring in Scala easier.\r\n\r\nAbstract","company":"SpringSource","talks":[{"title":"Using Spring in Scala","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2137","presentationId":2137}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2158/thumbnail.gif?time=1376397023887","firstName":"Arjen"},{"id":1993,"lastName":"Prijn","bio":"not available","company":"Info Support","talks":[{"title":"Migrating Real-World Million-Line Code Bases to Java 7: Lessons Learned","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1795","presentationId":1795}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Tim"},{"id":297,"lastName":"Quinn","bio":"Carl Quinn, member of the JavaPosse","company":"Java Posse","talks":[{"title":"JavaPosse LIVE","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2084","presentationId":2084}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/297/thumbnail.gif?time=1376397023940","firstName":"Carl","tweethandle":"@cquinn"},{"id":2098,"lastName":"Ramani","bio":"Nandini Ramani is vice president of engineering, Java client, and mobile platforms at Oracle. Her current focus includes driving JavaFX and the client platform and tools for Java, JavaME, and Java Card.\r\n\r\nRamani has a long history of creating innovation and futures at Sun Microsystems. She has been actively involved in JavaFX since its inception in 2007, and launched the platform and tools.\r\n\r\nPrior to joining the client group, Ramani worked in the Office of the Software CTO, driving the emerging technologies group for incubation projects. Having worked in the hardware architecture and simulation team in the Accelerated Graphics group as well as the graphics and media team for JavaME, her background includes both hardware and software. Ramani was involved in the development of XML standards as co-chair of the W3C Scalable Vector Graphics working group, and as a member of the W3C Compound Document Formats working group. She was also a member of several graphics- and UI-related expert groups in the Java Community Process.\r\n\r\nYou can follow her on Twitter at: @eyeseewaters","company":"Oracle","talks":[{"title":"Make the Future Java","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2121","presentationId":2121}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2098/thumbnail.gif?time=1376397023965","firstName":"Nandini","tweethandle":"@eyeseewaters"},{"id":1514,"lastName":"Ricau","bio":"Pierre-Yves Ricau (@Piwai) est Software Engineer Android chez Square (http://squareup.com/). Il est aussi le créateur d'AndroidAnnotations, mais promis, il n'en parlera pas lors de la présentation.","company":"Square","talks":[{"title":"Android DDD (Diet Driven Development)!","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1825","presentationId":1825}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1514/thumbnail.gif?time=1376397024007","firstName":"Pierre-Yves","tweethandle":"@Piwai"},{"id":2143,"lastName":"Rietveld","bio":"Marco is a Senior Software Engineer at JBoss, by Red Hat, where he works mostly on BPM technology related projects. However, he can't manage to keep his hands off mobile, cloud and testing technologies. Before finally realizing he was a developer at heart, Marco has worked as a sysadmin and as a business analyst.","company":"Red Hat","talks":[{"title":"OpenShift State of the Union","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2131","presentationId":2131}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2143/thumbnail.gif?time=1376397024097","firstName":"Marco","tweethandle":"@marcorietveld"},{"id":1912,"lastName":"Ritter","bio":"Simon Ritter is a Java Technology Evangelist at Oracle Corporation. Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K.\r\n\r\nOriginally working in the area of UNIX development for AT&T UNIX System Labs and then Novell, Simon moved to Sun in 1996. At this time he started working with Java technology and has spent time working both in Java technology development and consultancy. Having moved to Oracle as part of the Sun acquisition he now focuses on the core Java platform and Java for client applications. He also continues to develop demonstrations that push the boundaries of Java for applications like gestural interfaces.\r\n\r\nFollow him on Twitter, @speakjava and on his blog at blogs.oracle.com/speakjava.","company":"Oracle","talks":[{"title":"The Mocha Raspberry Pi Lab","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1675","presentationId":1675},{"title":"Do you like coffee with your dessert?  Java and the Raspberry Pi","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1602","presentationId":1602}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1912/thumbnail.gif?time=1376397024123","firstName":"Simon","tweethandle":"@speakjava"},{"id":853,"lastName":"Romberg","bio":"Tim has been active for 15 years as developer, researcher, and consultant with a focus on Enterprise Collaboration and Healthcare, in Germany and Belgium. His experience with MVC dates back to an ERP-related assignment on an early version of Borland Delphi.","company":"Creaficiency SPRL","talks":[{"title":"Scala Enthusiasts Gathering","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1612","presentationId":1612}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/853/thumbnail.gif?time=1376397024132","firstName":"Tim","tweethandle":"@rombergt"},{"id":1896,"lastName":"Rondal","bio":"When he's not busy with his family, traveling, or toying around with geeky stuff, Stephane Rondal is working with Java on a daily basis. \r\nHe has been doing so since 1996, developing web and database apps even before servlets and JDBC existed ;-)\r\nStephane is a frequent trainer on Java/Java EE matters, as well as on the Agile methodology.\r\nHe's also the co-founder of Arexo, a Belgian IT consultancy company.","company":"Arexo Consulting","talks":[{"title":"Why & How: JSON validation with JSON Schema and Jackson","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1936","presentationId":1936}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1896/thumbnail.gif?time=1376397024150","firstName":"Stephane","tweethandle":"@stephanerondal"},{"id":618,"lastName":"Sabot-Durand","bio":"Java EE expert and architect at Ippon Technologies a french consulting company. Antoine is mainly insterested in Java EE standard re-birth. He's member of the CDI 1.1 Expert Group and comiter on Apache Deltaspike. He's also the creator and tech lead on Agorava project, a java framework helping development around Social Media.","company":"Ippon Technologies","talks":[{"title":"Java Social JSR, it's alive","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2086","presentationId":2086}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Antoine","tweethandle":"@antoine_sd"},{"id":1981,"lastName":"Salnikov-Tarnovski","bio":"More than 10 years in Enterprise Java development for the largest custom software development company in the Baltics. Worked with customers from health care, telecom and the public sector from Scandinavia, the Baltics and Eastern Europe. In the last years specialised in troubleshooting, performance optimization and memory problem solving. \r\nIn 2011 co-founded Plumbr, the memory leak detection product (plumbr.eu), where he now contributes his full time as Master Developer.","company":"Plumbr OÜ","talks":[{"title":"How to solve memory leaks within minutes with Plumbr","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1882","presentationId":1882}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1981/thumbnail.gif?time=1376397024196","firstName":"Nikita","tweethandle":"@iNikem"},{"id":1883,"lastName":"Schauder","bio":"Jens Schauder is passionate about software development. In articles, his blogs, conference talks and his activity in the local JUG he tries to make the world of software development a slightly better one. Domain knowledge, programming languages, libraries, tools or methodology, everything deserves the effort to improve it.\r\n\r\nSince July 2012 Jens is employed by T-Systems on site services GmbH as an Executive Consultant.","company":"T-Systems On Site GmbH","talks":[{"title":"JUnit Rules","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1588","presentationId":1588}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1883/thumbnail.gif?time=1376397024252","firstName":"Jens","tweethandle":"@jensschauder"},{"id":1985,"lastName":"Seghers","bio":"Michael (Mike to everyone who knows him) started working as IT consultant mid-2001. Right at the start, Mike submerged in the world of Java, in which he promoted from junior over technical lead to architect. In this period, Mike has build enterprise web applications with the aid of well known frameworks such as Spring J(2)EE, JSF, Hibernate, ...\r\nLater on Mike built up experience in Adobe Flex and iOS development with a focus on enterprise integration. He has been giving iOS courses for the last two years.\r\nMike, together with his colleague iOS developers @iDAMediaFoundry,  has been responsible for the delivery of the iOS devoxx scheduler.","company":"iDA MediaFoundry","talks":[{"title":"Hands-On Intro to iOS6 for Java Developers","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2103","presentationId":2103},{"title":"Intro to iOS6 for Java Developers","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2101","presentationId":2101}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Michael","tweethandle":"@mikeseghers"},{"id":1716,"lastName":"Sertelon","bio":"Java/JEE Software Engineer, I'm one of the two initiators of Gatling, a new stress tool written in Scala. I love software development; learning and trying new technologies is what drives me every day.","company":"eBusiness Information","talks":[{"title":"Blast your webapp with Gatling","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1860","presentationId":1860}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1716/thumbnail.gif?time=1376397024354","firstName":"Romain","tweethandle":"@BluePyth"},{"id":1771,"lastName":"Shipilev","bio":"Aleksey Shipilev is Java SE Performance Engineer working for Sun/Oracle for 3+ years. His primary skills are performance engineering, benchmarking, JVMs, JITs, and class libraries. Aleksey is Oracle technical representative at Standard Performance Evaluation Corporation, responsible for building industry-standard Java benchmarks. Prior joining Sun, Aleksey was employed by Intel where he worked in Apache Harmony performance team for 3+ years.","company":"Oracle","talks":[{"title":"Performance Optimization Methodology","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2033","presentationId":2033}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1771/thumbnail.gif?time=1376397024383","firstName":"Aleksey","tweethandle":"@shipilev"},{"id":1701,"lastName":"Sikö","bio":"Pär is a java developer, working primarily with Android but with a long and happy history that includes J2ME, Swing and JavaFX.\r\nHe's been working with Java since it's inception and tried everything from architecture and large enterprise systems to mobile devices. \r\n\r\nAs a developer Pär is curious and thorough and knows the importance of pixels and colors.\r\nCurious to learn new things, growing as a human being in the process, and happy to teach and inspire others about it.\r\nThorough to ensure that the quality is on par with expectations and, perhaps most importantly, to really understand something makes it\r\nso much easier and fun to work with. Pixels and Colors have never been as important as it is today, everything is measured by it's looks,\r\nand Pär's focus on making beautiful applications is a deliberate strategy that has paid off numerous times.\r\n\r\nPär has been a busy speaker for the last couple of years, presenting on the international stage as well as on Swedish conferences.","company":"Jayway","talks":[{"title":"Having fun with Android mashups","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1811","presentationId":1811},{"title":"JavaFX Mashups","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2130","presentationId":2130}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1701/thumbnail.gif?time=1376397024392","firstName":"Pär","tweethandle":"@per_siko"},{"id":268,"lastName":"Smart","bio":"John is an experienced consultant and trainer specialising in Enterprise Java, Web Development, and Open Source technologies, based in Sydney, Australia. Well known in the Java community for his many published articles, and as author of Java Power Tools, John helps organisations around the world to optimize their Java development processes and infrastructures and provides training and mentoring in open source technologies, SDLC tools, and agile development processes. John is CEO of Wakaleo Consulting, a company that provides consulting, training and mentoring services in Enterprise Java and Agile Development. John is the author of 'Java Power Tools' and of the recently published 'Jenkins: The Definitive Guide'","company":"Wakaleo Consulting","talks":[{"title":"To ATDD and beyond! Better Automated Acceptance Testing on the JVM","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1496","presentationId":1496},{"title":"The bugs are building another Death Star","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2129","presentationId":2129},{"title":"Behaviour Driven Development on the JVM - a State of the Union","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1494","presentationId":1494}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/268/thumbnail.gif?time=1376397024409","firstName":"John","tweethandle":"@wakaleo"},{"id":1005,"lastName":"Smith","bio":"Shaun Smith is an active member of the Eclipse community and a Product Manager for Oracle TopLink. He's Ecosystem Development Lead for the EclipseLink project and a committer on the Eclipse Gemini Enterprise Modules, and the Dali Java Persistence Tools<\/a> projects. Prior to joining Oracle Shaun was a consultant specializing in enterprise application architecture and agile software development. \r\nHe's been involved with object persistence since 1996 starting with TopLink for Smalltalk and it's successor TopLink for Java. He's currently working on JPA for NoSQL databases, leveraging EclipseLink JPA and MOXy (JAXB and JSON binding) to accelerate the development of data services for HTML5 applications, and Oracle TopLink Grid which supports the scaling out of EclipseLink JPA applications using Oracle Coherence.","company":"ORACLE","talks":[{"title":"The Evolution of Java Persistence","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1951","presentationId":1951},{"title":"The newest JAX-RS and JPA Features","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2100","presentationId":2100}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1005/thumbnail.gif?time=1376397024436","firstName":"Shaun","tweethandle":"@shaunmsmith"},{"id":2095,"lastName":"Software Process Methodologist","bio":"Software Process Methodologist","company":"Methodologist","talks":[{"title":"The Future of Software Development Process Methodology Effectiveness (Part 2/2)","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2114","presentationId":2114},{"title":"The Future of Software Development Process Methodology Effectiveness (Part 1/2)","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2113","presentationId":2113}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2095/thumbnail.gif?time=1376397024453","firstName":"Chet Haase"},{"id":859,"lastName":"Soto","bio":"Alex Soto discovered Java during second year of his studies in computer science and wrote his Master's Thesis on Emergent Intelligence applied to Data Mining, winning the second prize of Hermano Salvador González contest. During his 11 years of software development, Alex has worked in several companies as technical consultant, and currently is working as technical analyst at a major international pharmaceutical company developing in-vitro medical software meeting FDA standards, where performance and safety is \"a must\". Alex also works as tutor at Open University of Catalonia (UOC), teaching Compilers course. He spends his free time to write in his blog, www.lordofthejars.com (DZone MVB), where some posts are published in sites like dzone, theserverside and springsource. Alex has spoken at Devoxx 2011 and Linuxtag 2012. Currently is developing NoSQLUnit, a JUnit extension for testing NoSQL systems.","company":"Diagnostic Grifols","talks":[{"title":"NoSQLUnit. Testing your NoSQL databases.","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1703","presentationId":1703}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/859/thumbnail.gif?time=1376397024459","firstName":"Alex","tweethandle":"@alexsotob"},{"id":2071,"lastName":"Spiewak","bio":"Daniel Spiewak is a software developer based out of Boulder, CO. Over the years, he has worked with Java, Scala, Ruby, C/C++, ML, Clojure and several experimental languages. He currently spends most of his free time researching parser theory and methodologies, particularly areas where the field intersects with functional language design, domain-specific languages and type theory.\r\n\r\nDaniel has written a number of articles on his weblog, Code Commit, including his popular introductory series, Scala for Java Refugees.","company":"Precog","talks":[{"title":"Functional Compilers: From CFG to EXE","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2088","presentationId":2088}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2071/thumbnail.gif?time=1376397024478","firstName":"Daniel","tweethandle":"@djspiewak"},{"id":215,"lastName":"Stormacq","bio":"Sébastien Stormacq is Websphere Solutions Sales Architect at IBM Luxembourg.\r\nHe uses his 18+ years of professional experience to map large organizations' paint points to IBM's Websphere Middleware Solutions solutions. Sébastien is focusing on large scale, secured, transactional and integrated solutions, based on SOA, BPM and mobile technologies.\r\nSébastien is passionate about IT Technology at large, with special interest in development platforms, the Java eco-system, mobile and cloud computing. Sébastien is the co-founder of the Luxembourg Java User Group.\r\nSébastien defines himself as a Geek 2.0, i.e. a geek with social and communication skills ... usually an empty set.\r\nWhen his two kids are quite - or asleep - he enjoys cooking, tasting wines, digital photography and hacking unix systems.\r\nYou can follow Sébastien at @sebsto or http://www.stormacq.com","company":"IBM","talks":[{"title":"Mobile Applications Development Lifecycle","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2116","presentationId":2116},{"title":"Hybrid mobile application development using Apache Cordova","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1959","presentationId":1959}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/215/thumbnail.gif?time=1376397024509","firstName":"Sébastien","tweethandle":"@sebsto"},{"id":1858,"lastName":"Suereth","bio":"Josh Suereth is a Senior Software Engineer at Typesafe and the author of \"Scala In Depth\". He has been a Scala enthusiast ever since he came to know this beautiful language in 2007. He started his professional career as a software developer in 2004, cutting his teeth with C++, STL and Boost.  Around the same time, Java fever was spreading and his interest was migrating to web-hosted distributed Java-delivered solutions to aide health departments discover the outbreaks of disease.  Everything from EJB to Hibernate/Spring and even some Applets.  He introduced Scala into his company code base first in 2007 and soon after he was infected by Scala fever, contributing to the Scala IDE, maven-scala-plugin and Scala itself. In 2009 he began writing the book \"Scala In Depth\" which provides practical support for using Scala in every day applications.   Today, Josh is the author of several open source scala projects, including the scala automated resource management library, the PGP sbt plugin, as well as contributing to key components in the Scala ecosystem, like the maven-scala-plugin.  His current work at Typesafe Inc. has him doing anything from building MSIs to profiling performance issues.  Josh regularly shares his expertise in articles and talks.","company":"Typesafe, Inc","talks":[{"title":"Effective Scala","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1922","presentationId":1922}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1858/thumbnail.gif?time=1376397024543","firstName":"Joshua"},{"id":120,"lastName":"Surtani","bio":"Manik Surtani is a core R&D engineer at JBoss, Red Hat's middleware division. He is the founder of the Infinispan project, and Platform Architect of the JBoss Data Grid. He is also the spec lead of JSR 347 (Data Grids for the Java Platform), and represents Red Hat on the Expert Group of JSR 107 (Temporary caching for Java). His interests lie in cloud and distributed computing, big data and NoSQL, autonomous systems and highly available computing.","company":"JBoss by Red Hat","talks":[{"title":"Will you map/reduce my cloud?  My data's getting big. (part 2/2)","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2127","presentationId":2127},{"title":"Will you map/reduce my cloud?  My data's getting big","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2126","presentationId":2126}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/120/thumbnail.gif?time=1376397024573","firstName":"Manik"},{"id":1501,"lastName":"Tardif","bio":"Guillaume has been working in software development projects since 1998, mainly in the java/JEE world. His typical roles in project teams include technical team lead/coach, senior agile developer, technical architect. He has also been teaching technical courses and did presentations at the Agile conference 2009 (Chicago), XP Days 2009 (Paris) and Devoxx France 2012 (Paris)","company":"Guillaume Tardif","talks":[{"title":"JDK 8 demo : Lambdas in Action","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1895","presentationId":1895}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1501/thumbnail.gif?time=1376397024579","firstName":"Guillaume","tweethandle":"@gtardif"},{"id":219,"lastName":"ten Bruggencate","bio":"Regina is a senior Java developer for iProfs and a Java Champion, with 10 plus years of Java experience mainly on enterprise applications. Regina is the current president of JDuchess, and as such has the responsibility for the site and community. Duchess is a global organization for women in Java technology, currently with 350 members in over 50 countries. Duchess provides a platform through which women who work with Java can connect with each other and get involved in the greater Java community. It aims to make women's role and the individual women's contributions visible in the Java community and to teach the benefits of diversity in any team environment - whether corporate or open-source.","company":"JDuchess","talks":[{"title":"Duchess meetup and unconference","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1704","presentationId":1704}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/219/thumbnail.gif?time=1376397024596","firstName":"Regina","tweethandle":"@reginatb38"},{"id":1572,"lastName":"Thomas","bio":"Alexandre THOMAS is a JEE, Android and iOS developer at eBusiness Information and a commiter on the AndroidAnnotations project. Along with Pierre-Yves Ricau, Alexandre spoke about AndroidAnnotations at Devoxx France and PAUG (Paris Android User Group). He is also member of VuzZz team (http://vuzzz.com) who won the Global Android DevCamp Paris 2012.","company":"Excilys","talks":[{"title":"Android DDD (Diet Driven Development)!","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1825","presentationId":1825}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1572/thumbnail.gif?time=1376397024627","firstName":"Alexandre","tweethandle":"@AleksThomas"},{"id":2068,"lastName":"Thomas","bio":"Thomas Eichstädt-Engelen, Senior Consultant at innoQ Deutschland, has a strong focus on developing individual custom software with Eclipse Technologies (Java, RCP, OSGi). In his spare time he is passionately enhancing openHAB where he is committer since 2010.","company":"innoQ Deutschland GmbH","talks":[{"title":"Home Automation for Geeks","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2075","presentationId":2075}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2068/thumbnail.gif?time=1376397024647","firstName":"Eichstädt-Engelen","tweethandle":"@teichsta"},{"id":345,"lastName":"Topic","bio":"Dalibor Topić lives in Hamburg, Germany, and works as Java F/OSS Ambassador for Oracle. He joined the OpenJDK project in order to help make it a successful open source project, and stayed for anchoring Java in Linux distributions, and as an all around Java F/OSS community guy. He joined the Java strategy team at Oracle to help provide community feedback into the long-term strategy planning.","company":"Oracle","talks":[{"title":"JDK 7 Updates: Director's Cut","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1543","presentationId":1543}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/345/thumbnail.gif?time=1376397024672","firstName":"Dalibor","tweethandle":"@robilad"},{"id":1635,"lastName":"Urma","bio":"Raoul started his PhD in Computer Science at the University of Cambridge at the age of 20. He is a frequent speaker at developer conferences. He holds a MEng in Computer Science from Imperial College London and graduated with first class honours having won several prizes for technical innovation. He has worked on several startup projects as well as worked for large companies such as eBay, Oracle, and Goldman Sachs.","company":"University of Cambridge","talks":[{"title":"Hacking the Java compiler for fun and profit","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1520","presentationId":1520}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1635/thumbnail.gif?time=1376397024703","firstName":"Raoul-Gabriel","tweethandle":"@raoulUK"},{"id":318,"lastName":"Van Boxel","bio":"Alex is working as an software engineer at Alcatel-Lucent’s mobile commerce group. In his day job he tries to break down walls between developments, testers and operations. He’s been part of the Java Community since version 1 and is still as enthusiastic and interested as ever in everything that happens around the virtual machine. Recently he started IOTOPE, an open platform for the Internet Of Things. With in it’s first incarnation concentrates on NFC (Near Field Communication).","company":"IOTOPE","talks":[{"title":"NFC, Arduino, Raspberry PI, Android and NodsJS Case-Study","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2083","presentationId":2083}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/318/thumbnail.gif?time=1376397024720","firstName":"Alex","tweethandle":"@alexvb"},{"id":70,"lastName":"Van den Enden","bio":"Stijn is CTO at ACA IT-Solutions. His background skills include software architecture, designing & implementing enterprise class systems based on XML & WebServices, Enterprise Application Integration and B2B integration. He also has a strong background in agile methods. Instructing Java, Patterns, Architecture & XML courses is another way of his involvement with the JEE technology. He advises customers with regards to their enterprise system blueprints, and how to streamline their development process while defining and maintaining the technical roadmap for ACA IT-Solutions.","company":"ACA IT-Solutions","talks":[{"title":"NFC, Arduino, Raspberry PI, Android and NodsJS Case-Study","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2083","presentationId":2083}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/70/thumbnail.gif?time=1376397024752","firstName":"Stijn"},{"id":1982,"lastName":"van der Pal","bio":"Linda is a developer at iProfs, the founder of Duchess and an active member of the Java community in general. She has been a Java developer for several companies since 2002.","company":"iProfs","talks":[{"title":"Docx4j - Generating Word and Excel files","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1777","presentationId":1777}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1982/thumbnail.gif?time=1376397024815","firstName":"Linda"},{"id":2113,"lastName":"VanCura","bio":"Heather VanCura manages the JCP Program Office and is responsible for the day-to-day nurturing, support, and leadership of the community. She oversees the JCP.org web site, JSR management and posting, community building, events, marketing, communications, and growth of the membership through new members and renewals.  Heather has a front row seat for studying trends within the community and recommending changes. Several changes to the program in recent years have included enabling broader participation, increased transparency and agility in JSR development.  When Heather joined the PMO staff in a community building marketing manager role for the JCP program, she was responsible for establishing the JCP brand logo programs, the JCP.org site, and engaging the community in online surveys and usability studies. She also developed marketing reward programs,  campaigns, sponsorships, and events for the JCP program, including the community gathering at the annual JavaOne Conference.   Before arriving at the JCP community in 2000, Heather worked with various technology companies.  Heather enjoys speaking at conferences, such as Devoxx, Java Zone, and the JavaOne Conferences. She maintains the JCP Blog<https://blogs.oracle.com/jcp/>, Twitter feed (@jcp_org) and Facebook page<http://www.facebook.com/pages/Java-Community-Process/109537315786054>.  Heather resides in the San Francisco Bay Area, California USA.","company":"JCP","talks":[{"title":"The JCP program: More that 101 ways to influence the future of the Java Platform","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2123","presentationId":2123}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2113/thumbnail.gif?time=1376397024835","firstName":"Heather"},{"id":2063,"lastName":"Vanderborght","bio":"Prof. Dr. Ir. Bram Vanderborght received the degree in Mechanical Engineering at the Vrije Universiteit Brussel in 2003. Since 2003 he is researcher at the Vrije Universiteit Brussel, supported by the Fund for Scientific Research Flanders (FWO). In May 2007 he received his PhD in Applied Sciences. The focus of his research was the use of adaptable compliance of pneumatic artificial muscles in the dynamically balanced biped Lucy. In May 2006 he performed research on the humanoids robot HRP-2 at the Joint Japanese/French Robotics Laboratory (JRL) in AIST, Tsukuba (Japan) in the on-going research “Dynamically stepping over large obstacles by the humanoid robot HRP-2\". He received a post-doc grant with mobility grant from the FWO. From October 2007-April 2010 he worked as post-doc researcher at the Italian Institute of Technology in Genova (Italy) on the humanoid robot iCub and compliant actuation. Since October 2009 is appointed as professor at the VUB. Since October 2011 he is part-time research director at Universitatea Babeș-Bolyai, Department of Clinical Psychology and Psychotherapy with a project on Robot Assisted Therapy with ASD children. He is author/co-author of 1 scientific book in the Springer STAR series, 2 science popularizing books about robots, 33 journal papers and about 90 international conference papers. He founded in Belgium the robot contest RoboCup Junior.","company":"Vrije Universiteit Brussel","talks":[{"title":"Robots That Care","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2074","presentationId":2074}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2063/thumbnail.gif?time=1376397024855","firstName":"Bram","tweethandle":"@BramVDBorght"},{"id":273,"lastName":"Venners","bio":"Bill Venners is president of Artima, Inc., publisher of Artima Developer (www.artima.com). He is author of the book, Inside the Java Virtual Machine, a programmer-oriented survey of the Java platform's architecture and internals. His popular columns in JavaWorld magazine covered Java internals, object-oriented design, and Jini. Active in the Jini Community since its inception, Bill led the Jini Community's ServiceUI project, whose ServiceUI API became the de facto standard way to associate user interfaces to Jini services.  Bill is also the lead developer and designer of ScalaTest, an open source testing tool for Scala and Java developers, and coauthor with Martin Odersky and Lex Spoon of the book, Programming in Scala.","company":"Artima, Inc.","talks":[{"title":"Scala advanced concepts and best practices","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2063","presentationId":2063},{"title":"Practical - Scala Koans","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2062","presentationId":2062},{"title":"Simplicity in Scala Design","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2073","presentationId":2073},{"title":"First steps with Scala","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2061","presentationId":2061}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/273/thumbnail.gif?time=1376397024888","firstName":"Bill","tweethandle":"@bvenners"},{"id":405,"lastName":"Verburg","bio":"Martijn Verburg (aka 'the Diabolical Developer'), CTO of jClarity, herds Cats in the Java/open source communities and is constantly humbled by the creative power to be found there!\r\n\r\nCurrently resides in London where he co-leads the London JUG (a JCP EC member), runs the Adopt a JSR and Adopt OpenJDK programmes and drinks good beer at his local pub. You can find him on-line facilitating development of FOSS projects (PCGen and Ikasan), moderating at the Javaranch or discussing (ranting about?) subjects on the Programmers Stack Exchange.\r\n\r\nHe's become a regular (diabolical) speaker at conferences on Java, FOSS and software development and has recently wrapped up his first Manning title - \"The Well-Grounded Java Developer\" with his co-author Ben Evans.\r\n\r\nMartijn was recognised as an official Java Champion in 2012 for services to the Java community.","company":"jClarity","talks":[{"title":"The second coming of JUGs","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2132","presentationId":2132},{"title":"Modern Software Development Anti-Patterns","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1709","presentationId":1709},{"title":"JUG Leaders BOF","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1711","presentationId":1711},{"title":"Adopt OpenJDK and Adopt a JSR","event":"BOF","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1710","presentationId":1710},{"title":"OpenJDK Hack Session (Bugathon for the Adopt OpenJDK Program)","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1707","presentationId":1707}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/405/thumbnail.gif?time=1376397024936","firstName":"Martijn","tweethandle":"@karianna"},{"id":1478,"lastName":"Viet","bio":"Julien Viet est chef de dévelopement produit portail chez eXo Platform basé sur le projet open source GateIn, colonne vertebrale\r\nde la solution intranet fournie par eXo Platform. Il s'implique fortement dans l'architecture et le développement du produit.\r\nAvant cela, Julien était ingénieur chez JBoss où il a crée le projet open source JBoss Portal en 2004. En quatres années, Julien a crée un serveur de portail avec son équipe.\r\n\r\nJulien a commencé dans l'open source au début des années 2000, principalement sur le serveur d'application JBoss 3, et a rejoint l'entreprise JBoss Group en 2002.\r\n\r\nJulien est passionné par l'open source en général et contribue régulièrement à plusieurs projets open source. Il a été actif dans plusieurs standards tels que la spécification Portlet 2.0 (JSR-286), la spécification Java Content Repository (JSR-283) et la spécification JSF Portlet Bridge (JSR-301). Julien a obtenu son diplôme d'ingénieur en télécommunication à l'Institut National des Télécommunications en 2001.","company":"eXo Platform","talks":[{"title":"CRaSH an extensible command line for the JVM","event":"Tools in Action","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1846","presentationId":1846}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1478/thumbnail.gif?time=1376397024956","firstName":"Julien","tweethandle":"@julienviet"},{"id":1,"lastName":"Voordeckers","bio":"Jo Voordeckers is no newcomer to the Java community, at JavaOne'08 he spoke on how to implement streaming video in the pre-release of JavaFX and also developed the Parleys.com JavaFX demo for the JavaOne'08 keynote. Next to his day job as a Java, web and mobile developer for Parleys.com and Devoxx, he is active in the Devoxx steering committee and the Belgium JUG where he drives the coding dojo sessions. Jo spends most of his free time experimenting with new technologies and enjoys speaking about Swing, JavaFX, Flex, Mercurial/GIT and lately HTML5. Jo has presented at JavaOne, Devoxx and BeJUG, blogs at blog.pursuit.be and tweets using @jovoordeckers","company":"Pursuit","talks":[{"title":"Progress at Parleys.com, a Java based e-Learning platform","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2049","presentationId":2049}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1/thumbnail.gif?time=1376397024963","firstName":"Jo","tweethandle":"@jovoordeckers"},{"id":272,"lastName":"Wall","bio":"Dick Wall, member of the JavaPosse, Partner with Escalate Software","company":"The Java Posse","talks":[{"title":"Scala advanced concepts and best practices","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2063","presentationId":2063},{"title":"Practical - Scala Koans","event":"Hands-on Labs","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2062","presentationId":2062},{"title":"JavaPosse LIVE","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2084","presentationId":2084},{"title":"First steps with Scala","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2061","presentationId":2061}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/272/thumbnail.gif?time=1376397024980","firstName":"Dick","tweethandle":"@dickwall"},{"id":176,"lastName":"Wanders","bio":"Integration architect with service orientation as specialization.\r\nPerforming SOA projects with Java since 2004, both on technical and organizational side.","company":"Archimiddle","talks":[{"title":"Service Versioning in SOA and Cloud","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1775","presentationId":1775}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/176/thumbnail.gif?time=1376397025008","firstName":"Ignaz","tweethandle":"@ignazw"},{"id":216,"lastName":"Ward","bio":"Tim Ward is a Senior Software Consultant at Zuhlke Engineering, a co-author of Enterprise OSGi in Action, and has been actively working with OSGi for over five years.  Tim has been a regular participant in the OSGi Core Platform and Enterprise Expert Groups, and led development of several specifications. Tim is also an active Open Source committer and a PMC member in the Apache Aries project, which provides a container for enterprise OSGi applications.","company":"Zuhlke Engineering","talks":[{"title":"Building Modular Applications with Enterprise OSGi","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1963","presentationId":1963}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/216/thumbnail.gif?time=1376397025081","firstName":"Timothy","tweethandle":"@TimothyWard"},{"id":1543,"lastName":"Weaver","bio":"James L. (Jim) Weaver is a Java and JavaFX developer, author, and speaker with a passion for helping rich-client Java and JavaFX become preferred technologies for new application development. Books that Jim has authored include Inside Java, Beginning J2EE, and Pro JavaFX 2.  His professional background includes 15 years as a systems architect at EDS, and the same number of years as an independent developer. As an Oracle Java Evangelist, Jim speaks internationally at software technology conferences. Jim blogs at http://javafxpert.com, tweets @javafxpert, and may be reached at james.weaver AT oracle.com.","company":"Oracle","talks":[{"title":"JavaFX Bootstrap","event":"University","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2079","presentationId":2079}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1543/thumbnail.gif?time=1376397025098","firstName":"Jim","tweethandle":"@javafxpert"},{"id":1797,"lastName":"West","bio":"Mike is a developer advocate on Google's Chrome team in Munich, Germany. Since it was relatively clear early on that it would be slightly more than difficult to make a living sitting under a tree while reading Kant, he's focused his energies on the web, which happily has proven itself to be a wonderful decision. He's a committer to both Chromium and WebKit, and has worked as a web developer at companies like Yahoo! and the Süddeutsche Zeitung.","company":"Google","talks":[{"title":"Securing the client side: Building safe web applications with HTML5","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1597","presentationId":1597}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/1797/thumbnail.gif?time=1376397025124","firstName":"Mike","tweethandle":"@mikewest"},{"id":2065,"lastName":"Wharton","bio":"Programmer, web developer, open source practitioner and contributor, and Android enthusiast","company":"Square, Inc.","talks":[{"title":"Bootstrapping Android Apps with Open Source","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2076","presentationId":2076}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/2065/thumbnail.gif?time=1376397025130","firstName":"Jake","tweethandle":"@JakeWharton"},{"id":208,"lastName":"Wielenga","bio":"Geertjan Wielenga is a principal product manager in Oracle for NetBeans and has been a member of the NetBeans Team for the past 7 years.","company":"NetBeans","talks":[{"title":"TinkerForge: Integrating Fun External Devices Via Java","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/2139","presentationId":2139}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/208/thumbnail.gif?time=1376397025147","firstName":"Geertjan"},{"id":1983,"lastName":"Wright","bio":"Nick is a Senior Consultant at C2B2 Consulting in the United Kingdom and JSR 343 (JMS 2.0) Expert Group member.","company":"C2B2 Consulting","talks":[{"title":"Java Message Service 2.0 Update","event":"Quickie","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1989","presentationId":1989}],"imageURI":"https://cfp-speaker-staging.devoxx.eu.cloudbees.net/img/thumbnail.gif","firstName":"Nick","tweethandle":"@c2b2consulting"},{"id":194,"lastName":"Zamarreño","bio":"Galder Zamarreño is a JBoss Core R&D Engineer working for Red Hat. He is the founder of Escalante, an application server for Scala, which he currently leads and he's also part of the Infinispan project development team where he's building next generation, distributed data grid software based on multiple languages. Galder has been worked with distributed, highly available, systems for almost 10 years and during that time, on top of building systems based on JBoss middleware, he's also worked in the retail industry building extremely escalable EFT software. The love for distributed systems and open source software comes from his days at ESIDE faculty at University of Deusto (Bilbao, Spain) where he studied a master's degree in Computer Science.","company":"JBoss by Red Hat","talks":[{"title":"The JBoss Polyglot Revolution - Be part of it!","event":"Conference","presentationUri":"https://staging-cfp.devoxx.com/rest/v1/events/presentations/1978","presentationId":1978}],"imageURI":"http://devoxxcfp-staging.s3.amazonaws.com/images/194/thumbnail.gif?time=1376397025254","firstName":"Galder","tweethandle":"@galderz"}]